<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>










 <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>Classic IE</title>
<style type="text/css">
h1 {
  font-family: "Times New Roman",Times,serif;
  color: #0070c0;
}
p {
  font-family: Arial,Helvetica,sans-serif;
}
body {
  font-family: Arial,Helvetica,sans-serif;
}

</style></head><body>
<h1><a target="_blank" href="http://www.classicshell.net/"><img src="images/OpenShell.png" style="border: 0px solid ; width: 64px; height: 64px;" alt="Site web Open-Shell" title="Site web Open-Shell"></a>&nbsp;
Classic IE</h1><span style="font-style: italic; color: rgb(0, 112, 192); font-weight: bold;"></span><span style="color: rgb(79, 129, 189); font-weight: bold;"><br>
Classic IE</span>
est une extension pour Internet Explorer qui :<br>
<ul>
  <li>Ajoute une l&eacute;gende &agrave; la barre des titres de fa&ccedil;on &agrave; ce que vous puissiez voir le titre complet de la page</li>
  <li>Affiche la zone de s&eacute;curit&eacute; dans la barre de statut</li>
  <li>Affiche le progr&egrave;s de chargement dans la barre de statut</li>
</ul>
<br>
Afficher le titre complet de la page m&ecirc;me lorsqu&#8217;il ne s&#8217;adapte pas &agrave; l&#8217;onglet :<br>
<img style="width: 837px; height: 219px;" alt="" src="images/ie9_caption.png"><br>
<br>Voir le progr&egrave;s et la zone de s&eacute;curit&eacute; :<br>
<img style="width: 412px; height: 35px;" alt="" src="images/ie9_status.png"><br>
<br>
<h1><a name="install"></a>Installation</h1>
Quand vous lancez Internet Explorer pour la premi&egrave;re fois apr&egrave;s avoir install&eacute;
Classic IE il vous avertira peut &ecirc;tre qu&#8217;un nouveau module compl&eacute;mentaire nomm&eacute; ClassicIEBHO est install&eacute; et si vous voulez l&#8217;activer.
Cliquez sur le bouton activer. Si vous n&#8217;avez cet avertissement, allez dans <span style="font-weight: bold;">Outils -&gt; G&eacute;rer les modules compl&eacute;mentaires</span> et assurez-vous que ClassicIEBHO est activ&eacute;. Apr&egrave;s avoir activ&eacute; le module compl&eacute;mentaire vous devrez red&eacute;marrer Internet Explorer pour activer l&#8217;extension.<br>
<br>
<h1><a name="settings"></a>Param&egrave;tres</h1>
Vous pouvez acc&eacute;der aux param&egrave;tres &agrave; partir de <span style="font-weight: bold;">Outils -&gt; Classic IE Settings</span>
ou &agrave; partir du menu d&eacute;marrer. Les param&egrave;tres contr&ocirc;lent la couleur et la police de la l&eacute;gende, et quelles informations sont &agrave; afficher dans la barre de statut.<br>

<img style="width: 683px; height: 438px;" alt="" src="images/ie9_settings.png"><br>
<br>Vous pouvez choisir de voir seulement les param&egrave;tres de base, ou tous les param&egrave;tres disponibles. Survolez chaque param&egrave;tre pour voir une description de leur fonction.
Saisissez un mot dans la zone de recherche pour retrouver un param&egrave;tre par son nom.<br>
Chaque param&egrave;tre &agrave; une valeur par d&eacute;faut. La valeur par d&eacute;faut peut &ecirc;tre une constante, ou elle peut d&eacute;pendre des param&egrave;tres syst&egrave;mes actuels.
Une fois que vous avez modifi&eacute; un param&egrave;tre il devient &quot;modifi&eacute;&quot; et est afficher en gras. Pour revenir &agrave; sa valeur par d&eacute;faut, clic droit sur le param&egrave;tre.<br>

<br>
Vous pouvez enregistrez les param&egrave;tres vers un fichier XML, et les recharger plus tard.
Appuyez sur le bouton <span style="font-weight: bold;">Sauvegarde</span> pour acc&eacute;der &agrave; ces fonctions. A partir de l&agrave; vous pouvez aussi r&eacute;initialiser tous les param&egrave;tres &agrave; leurs valeurs par d&eacute;faut.<br>


<br>


Appuyez sur OK pour stocker vos param&egrave;tres. Vous devrez red&eacute;marrer Internet Explorer pour appliquer les nouveaux settings.<br>


<br>
<h1><a name="admin"></a>Administrative Settings</h1>
Les param&egrave;tres sont par utilisateur et sont stocker dans la registrerie. Par d&eacute;faut chaque utilisateur peut modifier n&#8217;importe quel param&egrave;tre. Un administrateur peut verrouiller des param&egrave;tres sp&eacute;cifiques, de fa&ccedil;on &agrave; ce qu&#8217;aucun utilisateur ne puisse les modifier. Ceci est achev&eacute; en ajoutant le param&egrave;tre &agrave; la clef de registrerie <span style="font-weight: bold;">HKEY_LOCAL_MACHINE\SOFTWARE\OpenShell\ClassicIE</span><br>
<br>
Vous voudrez peut &ecirc;tre ne pas verrouiller le param&egrave;tre mais seulement surcharger sa valeur initiale. Pour cela, ajoutez &quot;_Default&quot; au nom de la valeur de la registrerie.<br>
<br>

La fa&ccedil;on la plus facile de conna&icirc;tre le nom registrerie d&#8217;un param&egrave;tre et &ccedil;a valeur pour la modifier, est de la rechercher dans <span style="font-weight: bold;">HKEY_CURRENT_USER\Software\OpenShell\ClassicIE\Settings</span>.<br>

Quelqes fois vous voudrez verrouiller un param&egrave;tre &agrave; sa valeur par d&eacute;faut, mais vous ne savez quelle est la valeur par d&eacute;faut. Dans ce cas cr&eacute;ez une valeur DWORD et 
configurez l&agrave; &agrave; 0xDEFA.<br>

<br>
Il y a aussi un param&egrave;tre global <span style="font-weight: bold;">EnableSettings</span>.  Configurez le &agrave; 0 dans la registrerie pour m&ecirc;me emp&ecirc;cher les utilisateurs d&#8217;ouvrir la bo&icirc;te de dialogue des Param&egrave;tres :<br>

<img style="width: 656px; height: 292px;" alt="" src="images/settings_disable_ie9.png"><br>
<br>

Modifier les param&egrave;tres au travers des strat&eacute;gies de groupe est aussi support&eacute;. D&eacute;compressez le fichier <b>PolicyDefinitions.zip</b> qui se trouve dans le dossier d&#8217;installation et lisez le document <b>PolicyDefinitions.rtf</b> pour plus de d&eacute;tails.<br>

<br>
</body></html>
