<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>



  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>Classic Explorer</title>
  <style type="text/css">
h1 {
  color: #0070c0;
  font-family: "Times New Roman",Times,serif;
}
body {
  font-family: Arial,Helvetica,sans-serif;
}

  </style></head><body>
<h1><a target="_blank" href="http://www.classicshell.net/"><img src="images/OpenShell.png" style="border: 0px solid ; width: 64px; height: 64px;" alt="Open-Shell website" title="Open-Shell website"></a>&nbsp; Classic Explorer</h1><span style="font-style: italic; color: rgb(0, 112, 192); font-weight: bold;"></span><br>
<span style="font-weight: bold; color: rgb(79, 129, 189);">Classic
Explorer</span> jest wtyczk&#261; do Eksploratora Windows, kt&#243;ra:

<ul>

  <li>Dodaje do paska narz&#281;dzi Eksploratora kilka typowych operacji (Przejd&#378; do folderu nadrz&#281;dnego, Wytnij, Kopiuj, Wklej, Usu&#324;, w&#322;a&#347;ciwo&#347;ci, E-mail).Pasek narz&#281;dzi jest w pe&#322;ni konfigurowalny </li>
  <li>Zast&#281;puje interfejs kopiowania w systemie Windows 7 bardziej przyjazn&#261; dla u&#380;ytkownika &#8220;klasyczn&#261;&#8221; wersj&#261; podobn&#261; do tej z systemu Windows XP</li>
  
  <li>Obs&#322;uguje Alt + Enter w panelu folder&#243;w Eksploratora Windows i wy&#347;wietla w&#322;a&#347;ciwo&#347;ci wybranego folderu</li>

  <li>Posiada opcje dostosowywania panelu folder&#243;w, aby wygl&#261;da&#322; podobnie jak w Windows XP i aby nie zanika&#322;y przyciski rozwijania</li>
  <li>Mo&#380;e pokazywa&#263; ilo&#347;&#263; wolnego miejsca na dysku i ca&#322;kowity rozmiar plik&#243;w na pasku stanu</li>
  <li>Mo&#380;na wy&#322;&#261;czy&#263; nawigacj&#281; za pomoc&#261; &#322;&#261;czy w pasku adresu</li>
  <li>Naprawia d&#322;ug&#261; list&#281; funkcji, kt&#243;re nie zosta&#322;y poprawione w Windows 7 - brak nak&#322;adki na ikon&#281; udost&#281;pnionych folder&#243;w, skoki folder&#243;w w panelu nawigacji, brak sortowania nag&#322;&#243;wk&#243;w w widoku listy, i wi&#281;cej<br>
  </li>




</ul><br>


<h1><a name="copy"></a>Nowy interfejs kopiowania (tylko Windows 7)<br>
</h1>

W systemie Vista podczas kopiowania plik&#243;w i istnieje konflikt, kt&#243;ry zosta&#322; pokazany poni&#380;ej:<br>

<br>

<img src="images/before.png" style="width: 460px; height: 472px;" alt="Before" title="Przed"><br>

<p>Co w tym oknie dialogowym jest nieprawid&#322;owe?</p>

<p>Na pocz&#261;tek to jest po&#322;owa ekranu pe&#322;nego tekstu, kt&#243;ry trzeba przeczyta&#263;. R&#243;wnie&#380; nie jest od razu jasne, jakie cz&#281;&#347;ci s&#261; klikalne. Musisz porusza&#263; myszk&#261;, aby odkry&#263; interfejs jak w <a target="_blank" href="http://en.wikipedia.org/wiki/Day_of_the_Tentacle">przygodowej grze Lucas Arts</a>. I wreszcie u&#380;yteczno&#347;&#263; klawiatury jest straszna. Aby powiedzie&#263;
<span style="font-weight: bold; color: rgb(79, 129, 189);">&#8220;tak, wiem co robi&#281;, chc&#281; zast&#261;pi&#263; wszystkie pliki&#8221;</span> musisz nacisn&#261;&#263; <strong><span style="color: rgb(79, 129, 189);">Alt+D, W g&#243;r&#281;, W g&#243;r&#281;, W g&#243;r&#281;, Spacja</span></strong>! To jest trudniejsze ni&#380; wykonywanie <a target="_blank" href="http://www.youtube.com/watch?v=AErqKebdqjU&amp;feature=fvw">akcji Akuma
Kara Demone</a> w Street Fighter 3. Tam jest czas i miejsce na takie rzeczy i nie jest to kopiowanie plik&#243;w.</p>

<p>Wtyczka Classic Explorer przywraca prostsze okno dialogowe z Windows XP:<br>
</p>

<p><img src="images/after.png" style="width: 438px; height: 251px;" alt="After" title="Po"><br>
</p>

<p>Tu jest od razu jasne, co jest klikalne <span style="font-style: italic;">(wskaz&#243;wka &#8211; przyciski na dole)</span>, istnieje &#322;atwa nawigacja za pomoc&#261; klawiatury (naci&#347;nij <span style="font-weight: bold; color: rgb(79, 129, 189);">Y</span> na &#8220;Tak&#8221;, <span style="font-weight: bold; color: rgb(79, 129, 189);">A</span> by skopiowa&#263; wszystkie pliki) i nadal mo&#380;na zobaczy&#263;, kt&#243;ry plik jest nowszy i kt&#243;ry jest wi&#281;kszy. I oczywi&#347;cie podobnie jak Windows XP, trzymaj&#261;c wci&#347;ni&#281;ty klawisz <strong style="color: rgb(79, 129, 189);">Shift</strong> podczas klikni&#281;cia na przycisk Nie oznacza "Nie dla wszystkich" (lub po prostu naci&#347;nij <strong style="color: rgb(79, 129, 189);">Shift+N</strong>).<br>
</p>

<p>Po klikni&#281;ciu na <span style="text-decoration: underline;">Wi&#281;cej&#8230;</span> otrzymasz oryginalne okno dialogowe z Windows. Gdzie mo&#380;na zobaczy&#263; wszystkie szczeg&#243;&#322;y i uzyskasz dodatkow&#261; opcj&#281; &#8220;Kopiuj, ale zachowaj oba pliki&#8221;.</p>
<p><span style="font-weight: bold;">Wa&#380;na uwaga:</span> Tylko interfejs zostaje zast&#261;piony. System bazowy, kt&#243;ry wykonuje rzeczywiste kopiowanie pozostaje nienaruszony.<br>
</p>
<p><br>
</p>



<h1><a name="alt_enter"></a>Alt+Enter w panelu folder&#243;w</h1>

Alt+Enter jest uniwersalnym skr&#243;tem w Windows, s&#322;u&#380;&#261;cym do otwierania w&#322;a&#347;ciwo&#347;ci zaznaczonego elementu. Ale w nowszych wersjach systemu Windows nie dzia&#322;a on w panelu po lewej stronie, w kt&#243;rym wy&#347;wietlane s&#261; foldery, za&#347; dzia&#322;a prawid&#322;owo w prawym panelu, w kt&#243;rym pokazywane s&#261; elementy wybranego folderu. Skr&#243;t dzia&#322;a wadliwie w por&#243;wnaniu z Windows XP, gdzie Alt+Enter dzia&#322;a w obu panelach.
<p>Ten problem rozwi&#261;zuje wtyczka Classic Explorer, kt&#243;ra wykrywa naci&#347;ni&#281;cie Alt+Enter i wy&#347;wietla w&#322;a&#347;ciwo&#347;ci aktualnie wybranego folderu.<br>
</p>
<p><br>
</p>


<h1><a name="toolbar"></a>Pasek narz&#281;dzi Eksploratora Windows</h1>
Eksplorator w Windows Vista nie ma paska narz&#281;dzi, takiego jak w Windows XP. Je&#347;li chcesz przej&#347;&#263; do folderu nadrz&#281;dnego musisz u&#380;y&#263; paska bu&#322;ce tartej. Je&#347;li chcesz skopiowa&#263; lub usun&#261;&#263; plik za pomoc&#261; myszki musisz klikn&#261;&#263; prawym przyciskiem myszy i poszuka&#263; odpowiedniego polecenia. Menu kontekstowe robi si&#281; coraz wi&#281;ksze i wi&#281;ksze, im wi&#281;cej zainstalowano rozszerze&#324; pow&#322;oki i znalezienie odpowiedniego polecenia mo&#380;e chwil&#281; potrwa&#263;.<br>
<p>Ten problem rozwi&#261;zuje wtyczka Classic Explorer dodaj&#261;c nowy pasek narz&#281;dzi:<br>
</p>

&nbsp;<img src="images/toolbar.png" alt="Explorer Toolbar" title="Pasek narz&#281;dzi Eksploratora"><br>
<br>
Dost&#281;pne przycisk to: W g&#243;r&#281;, Wytnij, Kopiuj, Wklej, Usu&#324;, W&#322;a&#347;ciwo&#347;ci,
E-mail, Ustawienia. Wi&#281;cej przycisk&#243;w mo&#380;na doda&#263; w oknie dialogowym Ustawienia.<br>
<br>
<span style="font-weight: bold; color: rgb(0, 112, 192);">Wskaz&#243;wki:</span><br>
&nbsp;&nbsp;&nbsp; - Przytrzymaj wci&#347;ni&#281;ty <strong>klawisz Ctrl</strong> podczas klikni&#281;cia na przycisk W g&#243;r&#281;, aby otworzy&#263; folder nadrz&#281;dny w nowym oknie Eksploratora.<br>
&nbsp;&nbsp;&nbsp; - Przytrzymaj wci&#347;ni&#281;ty <strong>klawisz Shift</strong> podczas klikni&#281;cia przycisku Usu&#324;, aby trwale usun&#261;&#263; plik.<br>

<br>

Po instalacji nowy pasek narz&#281;dzi nie jest automatycznie wy&#347;wietlany w Eksploratorze. Musisz zrobi&#263; kilka rzeczy, zanim b&#281;dzie mo&#380;na go u&#380;ywa&#263;:<br>

<ol style="font-family: Helvetica,Arial,sans-serif;">

  <li>Otw&#243;rz nowe okno Eksploratora Windows (Win key+E)</li>
  <li>W&#322;&#261;cz menu w Eksploratorze &#8211; Przejd&#378; do Narz&#281;dzi (ALT+T), Opcje folder&#243;w, karta Widok, i sprawd&#378; czy zaznaczone jest pole wyboru &#8220;Zawsze pokazuj menu&#8221;.</li>
  <li>Kliknij prawym przyciskiem myszy na pasku menu i wybierz &#8220;Pasek Classic Explorer&#8221;, aby wy&#347;wietli&#263; pasek narz&#281;dzi.</li>
  <li>Je&#347;li ta opcja nie jest dost&#281;pna (wida&#263; tylko  &#8220;Zablokuj paski narz&#281;dzi&#8221;) by&#263; mo&#380;e trzeba b&#281;dzie w&#322;&#261;czy&#263; wtyczk&#281; w Internet Explorer. Uruchom IE, kliknij prawym przyciskiem myszy na jego pasku narz&#281;dzi i wybierz &#8220;Pasek Classic Explorer&#8221;.
Program zapyta, czy chcesz w&#322;&#261;czy&#263; ten dodatek. Wybierz opcj&#281; &#8220;W&#322;&#261;cz&#8221;,
a nast&#281;pnie powt&#243;rz ponownie kroki od 1 do 3.</li>
  <li>Je&#380;eli pasek narz&#281;dzi dalej jest niewidoczny, by&#263; mo&#380;e w systemie wy&#322;&#261;czone s&#261; rozszerzenia przegl&#261;darki.  Zazwyczaj jest to ustawienie domy&#347;lne dla serwer&#243;w. Otw&#243;rz "Opcje internetowe", przejd&#378; do zak&#322;adki "Zaawansowane"  i zaznacz opcj&#281; "W&#322;&#261;cz rozszerzenia przegl&#261;darki innych firm".<br>
  </li>

</ol><br>
<h1><a name="statusbar"></a>Pasek stanu<br>
</h1>
Classic Explorer przywraca oryginalny pasek stanu Eksploratora, na kt&#243;rym wy&#347;wietlana jest ilo&#347;&#263; wolnego miejsca na dysku i rozmiar wybranych plik&#243;w:<br>
<br>
<img src="images/statusbar.png" style="width: 507px; height: 26px;" alt="File size in status bar" title="Rozmiar plik&#243;w na pasku stanu"><br>
<br>
W przeciwie&#324;stwie do wbudowanego pasku stanu rozmiar zaznaczenia jest wy&#347;wtetlany nawet je&#380;eli wybrano wi&#281;cej ni&#380; 100 plik&#243;w. Kiedy nie wybrano &#380;adnych plik&#243;w jest wy&#347;wietlany ca&#322;kowity rozmiar wszystkich plik&#243;w w folderze<br>
<br><strong>Uwaga dla Windows 7:</strong> Classic Explorer poprawia domy&#347;lny pasek stanu bez konieczno&#347;ci zast&#281;powania go. Aby go zobaczy&#263;, musisz go wpierw w&#322;&#261;czy&#263; w menu Widok. Pasek stanu jest r&#243;&#380;ny od niebieskiego okienka szczeg&#243;&#322;&#243;w, kt&#243;re mo&#380;na zobaczy&#263; na dole Eksploratora. Mo&#380;na wy&#322;&#261;czy&#263; okienko szczeg&#243;&#322;&#243;w z menu Organizuj, aby zaoszcz&#281;dzi&#263; miejsce. Ponadto istnieje b&#322;&#261;d w Eksploratorze Windows 7, kt&#243;ry niekiedy nie wy&#347;wietla &#380;adnego tekstu na pasku stanu. Naci&#347;nij klawisz <strong style="color: rgb(0, 112, 192);">F5</strong>, aby od&#347;wie&#380;y&#263; widok i uzyska&#263; tekst na pasku stanu.<br>
<br><strong>Uwaga dla Windows 8:</strong> Classic Explorer dodaje w&#322;asny pasek stanu. Nale&#380;y ukry&#263; domy&#347;lny pasek stanu, aby zaoszcz&#281;dzi&#263; miejsce. Na Wst&#261;&#380;ce wybierz kart&#281; Widok, a nast&#281;pnie kliknij Opcje. Wybierz kart&#281; Widok w oknie Opcje. Znajd&#378; "Poka&#380; pasek stanu" i odznacz pole wyboru.
<br>
<br>


<h1><a name="settings"></a>Ustawienia</h1>Mo&#380;na uzyska&#263; dost&#281;p do ustawie&#324; Classic Explorer z paska narz&#281;dzi lub z menu Start:<br><br>
<img style="width: 682px; height: 465px;" alt="" src="images/explorer_settings.png"><br>
<br>Mo&#380;na wybra&#263; tylko widok podstawowych ustawie&#324;, lub wszystkich dost&#281;pnych ustawie&#324;. Umieszczaj&#261;c wska&#378;nik myszy nad ka&#380;dym ustawieniem, mo&#380;na zobaczy&#263; jego kr&#243;tki opis. Wpisuj&#261;c w polu wyszukiwania nazw&#281; ustawienia, wyszukasz je wed&#322;ug nazwy.<br>
Ka&#380;de ustawienie ma warto&#347;&#263; domy&#347;ln&#261;. Warto&#347;&#263; domy&#347;lna mo&#380;e by&#263; sta&#322;a, lub mo&#380;e zale&#380;e&#263; od bie&#380;&#261;cych ustawie&#324; systemowych. Po modyfikacji to ustawienie staje si&#281; "zmodyfikowanym" i jest wy&#347;wietlane pogrubion&#261; czcionk&#261;. Aby powr&#243;ci&#263; do warto&#347;&#263; domy&#347;lnej, kliknij prawym przyciskiem myszy na ustawienie.
<br>
<br>Mo&#380;na zapisa&#263; ustawienia do pliku XML, a p&#243;&#378;niej za&#322;adowa&#263; je z powrotem. Naciskaj&#261;c przycisk <span style="font-weight: bold;">Kopia zapasowa</span> uzyskasz dost&#281;p do tych funkcji. Stamt&#261;d mo&#380;na tak&#380;e zresetowa&#263; wszystkie ustawienia do ich warto&#347;ci domy&#347;lnych.
<br>

<br>

Naci&#347;nij przycisk OK, aby zapisa&#263; ustawienia. Wi&#281;kszo&#347;&#263; ustawie&#324; zostanie wprowadzona podczas nast&#281;pnego otwarcia nowego okna Eksploratora. Niewielka liczba ustawie&#324; wymaga wylogowania przed wprowadzeniem zmian.<br>

<br>

<span style="font-weight: bold;">Uwaga:</span> Okno Wszystkie ustawienia jest skalowalne. Mo&#380;na zmienia&#263; jego rozmiary i umieszcza&#263; w wybranym po&#322;o&#380;eniu. Okno zapami&#281;ta swoj&#261; now&#261; pozycj&#281;..<br>

<br>
Oto jeden z przyk&#322;ad&#243;w jakie mog&#261; wprowadzi&#263; odpowiednie dostosowania:<br><br>

    <img src="images/titlebar.png" alt="Title bar tweaks" title="Ulepszenia paska tytu&#322;u"><br>
<br>
Kliknij na zak&#322;adk&#281; <span style="font-weight: bold;">Przyciski paska narz&#281;dzi</span>, aby dostosowa&#263; pasek narz&#281;dzi:<br><br>
<img style="width: 682px; height: 465px;" alt="" src="images/toolbar_settings.png"><br>
<br>Przyciski mog&#261; by&#263; przeci&#261;gane i upuszczane z prawej do lewej kolumny. Mo&#380;na zmienia&#263; kolejno&#347;&#263; przycisk&#243;w, przeci&#261;gaj&#261;c je w g&#243;r&#281; lub w d&#243;&#322;. Je&#347;li upu&#347;cisz jeden przycisk wewn&#261;trz drugiego to utworzysz podmenu.<br>
Umieszczaj&#261;c wska&#378;nik myszy nad ka&#380;dym przyciskiem, mo&#380;na zobaczy&#263; jego kr&#243;tki opis. Kliknij prawym przyciskiem myszy na ka&#380;dym przycisku, aby uzyska&#263; dost&#281;p do dodatkowych funkcji (jak Usu&#324;, Zmie&#324; nazw&#281;, itp.). Z menu kontekstowego mo&#380;na r&#243;wnie&#380; przywr&#243;ci&#263; pasek narz&#281;dzi do pierwotnego stanu.<br>
Ka&#380;da pozycja w lewej kolumnie musi mie&#263; unikatow&#261; nazw&#281;. Jest nim identyfikator elementu, kt&#243;ry mo&#380;e zawiera&#263; tylko angielskie litery, cyfry i podkre&#347;lenie. Niekt&#243;re elementy (takie jak SEPARATOR) nie mog&#261; by&#263; zmieniane.<br>
<br>
<span style="font-weight: bold;">Wa&#380;na uwaga:</span> Nie wszystkie dost&#281;pne polecenia maj&#261; domy&#347;lne ikony lub tekst. To dlatego, &#380;e Windows nie ma ikony na takie polecenia jak <span style="font-weight: bold;">Cofnij</span>, <span style="font-weight: bold;">Zaznacz wszystko</span>, itp. Je&#347;li chcesz u&#380;y&#263; tych przycisk&#243;w w pasku narz&#281;dzi b&#281;dziesz musia&#322; wprowadzi&#263; swoje w&#322;asne ikony. Zobacz poni&#380;ej, jak to zrobi&#263;.<br>
<br>
Po umieszczeniu przycisku na pasku narz&#281;dzi, mo&#380;na edytowa&#263; jego atrybuty. Kliknij dwukrotnie na przycisku, aby go edytowa&#263;:<br><br>
<img style="width: 446px; height: 375px;" alt="Edit toolbar button" title="Edycja przycisku paska narz&#281;dzi" src="images/button_settings.png"><br><br>
Tutaj mo&#380;na wybra&#263; polecenie dla przycisku, jego tekst i ikon&#281;. Naci&#347;nij przycisk <span style="font-weight: bold;">Przywr&#243;&#263; domy&#347;lne</span>, aby uzyska&#263; domy&#347;lny tekst i ikon&#281; dla wybranego polecenia.<br>
Poleceniem mo&#380;e by&#263;:<br>
<ul>

  
  <li><span style="font-weight: bold;">pozostawiono puste</span> - je&#347;li jest stosowany atrybut &#322;&#261;cze, to b&#281;dzie dzia&#322;a&#263; jako polecenie</li>
<li><span style="font-weight: bold;">jedno z predefiniowanych polece&#324;</span> - z rozwijanej listy</li>
  <li><span style="font-weight: bold;">open &lt;some folder&gt;</span> (otw&#243;rz &lt;jaki&#347; folder&gt;) - otwiera folder w bie&#380;&#261;cej przegl&#261;darce</li>
  <li><span style="font-weight: bold;">sortby &lt;property&gt;</span> (sortuj wed&#322;ug &lt;w&#322;a&#347;ciwo&#347;ci&gt;) -  sortuje folder wed&#322;ug danej w&#322;a&#347;ciwo&#347;ci - <span style="font-weight: bold;">nazwa, typ, rozmiar </span>lub<span style="font-weight: bold;"> data</span>. U&#380;yj znaku '-' przed w&#322;a&#347;ciwo&#347;ci&#261;, aby sortowa&#263; w porz&#261;dku malej&#261;cym: <span style="font-weight: bold;">"sortby -name"</span>. Mo&#380;na u&#380;y&#263; innych w&#322;a&#347;ciwo&#347;ci, je&#347;li znasz ich kod. Na przyk&#322;ad <span style="font-weight: bold;">"sortby {B725F130-47EF-101A-A5F1-02608C9EEBAC}, 10"</span> jest tym samym, co <span style="font-weight: bold;">"sortby name"</span>. Wi&#281;cej kod&#243;w w&#322;a&#347;ciwo&#347;ci mo&#380;na znale&#378;&#263; w pliku <span style="font-weight: bold;">propkey.h</span> w Windows SDK (kody mo&#380;na r&#243;wnie&#380; znale&#378;&#263; <a href="http://msdn.microsoft.com/en-us/library/cc251929%28v=prot.10%29.aspx">tutaj</a> - przewi&#324; w d&#243;&#322; do "Pe&#322;na tabela w&#322;a&#347;ciwo&#347;ci"). Nie wszystkie kody w&#322;a&#347;ciwo&#347;ci s&#261; wa&#380;ne lub obs&#322;ugiwane (np. w&#322;a&#347;ciwo&#347;&#263; <span style="font-weight: bold;">rok albumu</span> <span style="font-weight: bold;">{56A3372E-CE9C-11D2-9F0E-006097C686F6}, 5</span> dzia&#322;a tylko podczas wy&#347;wietlania album&#243;w muzycznych)</li>
  <li><span style="font-weight: bold;">groupby &lt;property&gt;</span> (grupuj wed&#322;ug &lt;w&#322;a&#347;ciwo&#347;ci&gt;) - podobne do <span style="font-weight: bold;">sortby</span>, lecz grupuje pliki wed&#322;ug danej w&#322;a&#347;ciwo&#347;ci. U&#380;yj polecenia <span style="font-weight: bold;">groupby</span> bez w&#322;a&#347;ciwo&#347;ci, aby wy&#322;&#261;czy&#263; grupowanie<br>
  </li>


  
  <li><span style="font-weight: bold;">niestandardowy ci&#261;g wykonywalny</span>
- mo&#380;e to by&#263; nazwa programu i jego argumenty, a nawet adres URL (np. http://www.google.com). Mo&#380;na r&#243;wnie&#380; u&#380;ywa&#263; zmiennych &#347;rodowiskowych, takich jak <span style="font-weight: bold;">%SystemRoot%</span>. Mo&#380;na r&#243;wnie&#380; u&#380;y&#263; symboli zast&#281;pczych <span style="font-weight: bold;">%1</span>, <span style="font-weight: bold;">%2</span>, <span style="font-weight: bold;">%3</span>, <span style="font-weight: bold;">%4</span> i <span style="font-weight: bold;">%5</span>:</li>
  <ul>
    <li><span style="font-weight: bold;">%1</span> to &#347;cie&#380;ka do bie&#380;&#261;cego folderu. Nale&#380;y pami&#281;ta&#263;, &#380;e je&#347;li bie&#380;&#261;cy folder jest katalogiem g&#322;&#243;wnym dysku, to b&#281;dzie zako&#324;czony uko&#347;nikiem (jak C:\)<br>
    </li>
    <li><span style="font-weight: bold;">%2</span> jest &#347;cie&#380;k&#261; do wybranego pliku (tylko w przypadku wybrania pojedynczego pliku)</li>
    <li><span style="font-weight: bold;">%3</span>
to nazwa pliku tekstowego tymczasowego, kt&#243;ry zawiera wszystkie wybrane pliki. Ka&#380;dy wiersz w pliku tekstowym zawiera pe&#322;n&#261; &#347;cie&#380;k&#281; jednego pliku<br>
</li>
    <li><span style="font-weight: bold;">%4</span>
to samo co %3, ale plik jest w formacie Unicode (UTF16).Plik nie zawiera znacznika kolejno&#347;ci bajt&#243;w. %3 i %4 nie mog&#261; by&#263; u&#380;ywane w tym samym poleceniu<br>
</li>
    <li><span style="font-weight: bold;">Uwaga dla programist&#243;w: </span>Gdy u&#380;ywany jest parametr %3 lub %4, to polecenie powinno na ko&#324;cu usuwa&#263; plik tymczasowy. W przeciwnym razie plik tymczasowy zostanie pozostawiony na dysku i b&#281;dzie zajmowa&#322; niepotrzebnie miejsce. Polecenie b&#281;d&#261;ce aplikacj&#261; konsoli lub plikiem wsadowym jest uruchamiane w trybie cichym, bez wy&#347;wietlania okna konsoli</li>

    <li><span style="font-weight: bold;">%5</span> to nazwa tymczasowego pliku tekstowego, kt&#243;ry mo&#380;e by&#263; u&#380;yty do zwr&#243;cenia polecenia z powrotem do Classic Explorer. Je&#347;li pierwszymi 2 bajtami pliku s&#261; 255 i 254, plik jest traktowany jako Unicode. Tylko jedno polecenie mo&#380;e by&#263; u&#380;ywane w tym samym czasie. Poleceniem tym mo&#380;e by&#263;:</li>
    <ul>
      <li><span style="font-weight: bold;">open &lt;folder name&gt;</span> (otw&#243;rz &lt;nazwa folderu&gt;) - spowoduje przej&#347;cie do danego folderu w Eksploratorze</li>
      <li><span style="font-weight: bold;">select &lt;list of file names&gt;</span> (wybierz &lt;lista nazw plik&#243;w&gt;)
- wybiera podane pliki, odznaczaj&#261;c pozosta&#322;e. Nazwy plik&#243;w musz&#261; by&#263; oddzielone znakiem tabulacji lub znakiem nowego wiersza. Pliki nie powinny zawiera&#263; &#347;cie&#380;ek. Je&#347;li zostanie zignorowany &#347;cie&#380;ka<br>
      </li>
      <li><span style="font-weight: bold;">refresh</span> (od&#347;wie&#380;) - od&#347;wie&#380;a Eksploratora</li>
    </ul>
  </ul>
  <ul>
    <li><span style="font-weight: bold;">Uwaga dla programist&#243;w:</span>
polecenia u&#380;ywaj&#261;ce %5 zostan&#261; uruchomione w trybie cichym (tak jak polecenia u&#380;ywaj&#261;ce %3 lub %4) i Eksplorator b&#281;dzie czeka&#322; na zako&#324;czenie procesu. Proces musi zako&#324;czy&#263; si&#281; najszybciej jak to mo&#380;liwe, poniewa&#380; Explorer b&#281;dzie zamro&#380;ony podczas wykonywania polecenia</li>
    <li>W nast&#281;pnej sekcji podano kilka przyk&#322;ad&#243;w, jak u&#380;ywa&#263; tych parametr&#243;w<br>
    </li>

  </ul>
</ul>
&#321;&#261;cze mo&#380;e by&#263; &#347;cie&#380;k&#261; do pliku lub folderu. Je&#347;li jest to plik, plik zostanie wykonany. Je&#347;li to jest folder, folder zostanie otworzony w podmenu. (tylko dla przycisk&#243;w najwy&#380;szego poziomu).<br>
<br>
Ikon&#261; mo&#380;e by&#263;:<br style="font-weight: bold;">
<ul>
  <li><span style="font-weight: bold;">pozostawiono puste</span> - je&#347;li atrybut &#322;&#261;cza wskazuje na plik lub folder, to zostanie u&#380;yta ikona pliku lub folderu<br>
    <span style="font-weight: bold;"></span></li>
  <li><span style="font-weight: bold;">plik zasob&#243;w, ID ikony</span> - na przyk&#322;ad <span style="font-weight: bold;">%windir%\notepad.exe,2</span>. Nie nale&#380;y pozostawia&#263; spacji mi&#281;dzy nazw&#261; pliku a przecinkiem. <span style="font-weight: bold;">Upewnij si&#281;, &#380;e u&#380;ywasz identyfikatora zasobu ikony, a nie indeksu ikony.</span> Aby uzyska&#263; najlepsze rezultaty nale&#380;y u&#380;y&#263; przycisku <span style="font-weight: bold;">[...]</span> umieszczonego przy polu Ikona</li>
  <li><span style="font-weight: bold;">ID ikony</span> - jak wy&#380;ej, ale plikiem zasob&#243;w jest <span style="font-weight: bold;">ClassicExplorer.dll</span>. Jest to przydatne, gdy odnosi si&#281; do ikon w&#322;asnych Classic Explorer<br>
  </li>
  <li><span style="font-weight: bold;">plik ikony</span> -&nbsp; na przyk&#322;ad <span style="font-weight: bold;">C:\Program Files\Mozilla Thunderbird\Email.ico</span></li>
  <li><span style="font-weight: bold;">brak</span> - zostanie u&#380;yta pusta ikona</li>
</ul>
Je&#380;eli atrybut etykiety lub porady rozpoczyna si&#281; znakiem <span style="font-weight: bold;">$</span> (znak dolara), wtedy system b&#281;dzie traktowa&#263; go jako nazw&#281; ci&#261;gu w pliku <span style="font-weight: bold;">ExplorerL10N.ini</span>. Rzeczywisty tekst zale&#380;y od bie&#380;&#261;cego ustawienia j&#281;zyka. Jest to przydatne podczas tworzenia paska narz&#281;dzi, kt&#243;ry mo&#380;e by&#263; u&#380;ywany przez wiele j&#281;zyk&#243;w.<br>
<br>
<span style="font-weight: bold;">Uwaga dla programist&#243;w: </span>Przyciski niestandardowych polec&#324; mog&#261; by&#263; zaznaczone lub wy&#322;&#261;czone. Pasek narz&#281;dzi sprawdza w kluczu rejestru <span style="font-weight: bold;">HKCU\Software\OpenShell\ClassicExplorer</span>
warto&#347;&#263; DWORD o nazwie przycisk (nazwa u&#380;ywana w lewej kolumnie). 0 oznacza normalny, 1 wy&#322;&#261;czona, i 2 zaznaczony. Pasek narz&#281;dzi odczytuje klucz rejestru podczas uruchamiania. Aby wymusi&#263; aktualizacj&#281; stanu przycisk&#243;w po uruchomieniu musisz znale&#378;&#263; wszystkie okna Eksploratora, zlokalizowa&#263; okno podrz&#281;dne z klasy <span style="font-weight: bold;">OpenShell.CBandWindow</span> i umie&#347;ci&#263; wiadomo&#347;&#263; <span style="font-weight: bold;">WM_CLEAR</span>. Jest to przydatne, je&#380;eli utworzysz w&#322;asny exe, kt&#243;ry b&#281;dzie wykorzystywany przez pasek narz&#281;dzi.<br>

<br>
<h1><a name="examples"></a>Przyk&#322;ady polece&#324; niestandardowych</h1>
<h3>1) U&#380;yj cudzys&#322;owy, gdy jest to konieczne</h3>Aby by&#322;y obs&#322;ugiwane &#347;cie&#380;ki zawieraj&#261;ce spacje, nale&#380;y parametry &#347;cie&#380;ki uj&#261;&#263; w cudzys&#322;owy. Cudzys&#322;owy nie zawsze s&#261; potrzebne jak to pokazano poni&#380;ej w przyk&#322;adach 2 i 3. Upewnij si&#281;, czy tekst komendy &#347;cie&#380;ki zawiera spacje, aby unikn&#261;&#263; niespodzianek.<br>
<br>
<h3>2) Drukuj bie&#380;&#261;cy folder</h3>

U&#380;yj tego polecenia: <span style="font-weight: bold;">cmd.exe /k echo %1</span>. %1 zostanie zast&#261;pione przez &#347;cie&#380;k&#281; bie&#380;&#261;cego folderu.<br>
<br>
<h3>3) Otw&#243;rz wybrany plik w Notatniku</h3>
U&#380;yj tego polecenia: <span style="font-weight: bold;">%SystemRoot%\notepad.exe %2</span>.
%2 zostanie zast&#261;pione przez pe&#322;n&#261; nazw&#281; wybranego pliku. Polecenie nie
musi by&#263; uj&#281;te w cudzys&#322;owy, poniewa&#380; Notatnik u&#380;ywa ca&#322;y wiersz polecenia jako nazw&#281; pliku.<br>
<br>
<h3>4) Kopiuj wybrane pliki do folderu nadrz&#281;dnego<br>
</h3>
Utw&#243;rz plik wsadowy o nazwie <span style="font-weight: bold;">C:\CopyParent.bat:<br><span style="font-family: monospace;">
set list=%1<br>
set list=%list:"=%<br>
for /F "delims=" %%i in (%list%) do copy /Y "%%i" ..<br>
del %1<br style="font-family: monospace;"></span></span>
<br>
U&#380;yj tego polecenia: <span style="font-weight: bold;">C:\</span><span style="font-weight: bold;">CopyParent</span><span style="font-weight: bold;">.bat "%3"</span>.
%3 zostanie zast&#261;piony przez plik tekstowy zawieraj&#261;cy pe&#322;ne nazwy wszystkich wybranych plik&#243;w. Plik wsadowy odczytuje ka&#380;dy wiersz z tego pliku tekstowego i kopiuje ka&#380;dy z wybranych plik&#243;w do folderu nadrz&#281;dnego. Na ko&#324;cu plik wsadowy usuwa pocz&#261;tkowy plik temp. Pierwsze dwa polecenia usuwaj&#261; cudzys&#322;owy z parametru %1<br>
<br>
<h3>5) Wybierz wszystkie pliki tekstowe</h3>
Utw&#243;rz plik wsadowy o nazwie <span style="font-weight: bold;">C:\SelectText.bat</span>:<br>
<span style="font-weight: bold; font-family: monospace;">echo select &gt; %1</span><br style="font-weight: bold; font-family: monospace;">
<span style="font-weight: bold; font-family: monospace;">dir *.txt /b &gt;&gt; %1</span><br style="font-weight: bold; font-family: monospace;">
<br>
U&#380;yj tego polecenia: <span style="font-weight: bold;">C:\SelectText.bat "%5".</span>
%5 zostanie zast&#261;pione pustym plikiem tekstowym, kt&#243;rego polecenie musi zawiera&#263; s&#322;owo wyj&#347;ciowe "select" i list&#281; plik&#243;w, kt&#243;re chce si&#281; wybra&#263;. Polecenie "dir
*.txt /b" udost&#281;pnia t&#281; list&#281;.<br>
<br>
<br>

<h1><a name="admin"></a>Ustawienia administracyjne</h1>Ustawienia dotycz&#261; poszczeg&#243;lnych u&#380;ytkownik&#243;w i przechowywane s&#261; w rejestrze. Domy&#347;lnie ka&#380;dy u&#380;ytkownik mo&#380;e edytowa&#263;
wszystkie swoje ustawienia. Administrator mo&#380;e zablokowa&#263; okre&#347;lone ustawienia, wi&#281;c &#380;aden u&#380;ytkownik nie b&#281;dzie m&#243;g&#322; ich edytowa&#263;:<br><br>
<img style="width: 682px; height: 465px;" alt="" src="images/up_locked.png"><br><br>
W tym przyk&#322;adzie ustawienie "Poka&#380; przycisk W g&#243;r&#281;" jest zablokowane, tak aby ten przycisk zawsze by&#322; wy&#347;wietlany przed przyciskami Wstecz/Dalej. I ustawienie to nie mo&#380;e by&#263; zmienione przez dowolnego u&#380;ytkownika. Osi&#261;ga si&#281; to przez dodanie odpowiednich ustawie&#324; w kluczu rejestru <span style="font-weight: bold;">HKEY_LOCAL_MACHINE\SOFTWARE\OpenShell\ClassicExplorer</span>. Nale&#380;y utworzy&#263; warto&#347;&#263; ci&#261;gu o nazwie "ShowUpButton" i ustawi&#263; jej warto&#347;&#263; na "BeforeBack".<br>
<br>W niekt&#243;rych przypadkach mo&#380;esz nie chcie&#263; zablokowa&#263; warto&#347;ci dla wszystkich u&#380;ytkownik&#243;w, ale
jedynie chcesz zmieni&#263; pocz&#261;tkow&#261; warto&#347;&#263; ustawienia. W takim przypadku nale&#380;y doda&#263;
"_Default" do nazwy warto&#347;ci. Na przyk&#322;ad, aby przycisk W g&#243;r&#281; by&#322; domy&#347;lnie wy&#347;wietlany przed przyciskami Wstecz/Dalej, ale u&#380;ytkownicy mieli nadal mo&#380;liwo&#347;&#263; wprowadzenia zmiany, gdy tego chc&#261;, nale&#380;y utworzy&#263; warto&#347;&#263; ci&#261;gu o nazwie "ShowUpButton_Default" i ustawi&#263; jej warto&#347;&#263; na "BeforeBack".<br>
<br>
Najprostszym sposobem poznania nazwy ustawienia i jego warto&#347;ci w rejestrze, kt&#243;re chcesz zmodyfikowa&#263;, jest odszukanie go w kluczu <span style="font-weight: bold;">HKEY_CURRENT_USER\Software\OpenShell\ClassicExplorer\Settings</span>.<br>
Czasem mo&#380;esz chcie&#263; zablokowa&#263; warto&#347;&#263; domy&#347;ln&#261; ustawienia, ale nie znasz jej warto&#347;ci. W takim przypadku utw&#243;rz warto&#347;&#263; DWORD i ustaw jej warto&#347;&#263; na 0xDEFA.<br>
<br>
Istnieje r&#243;wnie&#380; ustawienie globalne "EnableSettings". Ustawienie jego warto&#347;ci na 0 w rejestrze blokuje u&#380;ytkownikom mo&#380;liwo&#347;&#263; otworzenia okna dialogowego Ustawienia:<br><br>
<img style="width: 603px; height: 257px;" alt="Disable all settings" title="Disable all settings" src="images/settings_disable_ex.png"><br>
<br>
Mo&#380;na w&#322;&#261;czy&#263; lub wy&#322;&#261;czy&#263; poszczeg&#243;lne procesy w Classic Explorer przy u&#380;yciu dw&#243;ch ustawie&#324; rejestru "ProcessWhiteList" i "ProcessBlackList". <span style="font-weight: bold;">ProcessWhiteList </span> jest to lista &#322;adowanych proces&#243;w przez Classic Explorer. U&#380;yj tylko nazwy pliku procesu (np. "notepad.exe"), oddzielaj wiele nazw za pomoc&#261; przecinka lub &#347;rednika. <span style="font-weight: bold;">ProcessBlackList</span>
jest to lista nie&#322;adowanych proces&#243;w przez Classic Explorer. Nale&#380;y u&#380;ywa&#263; tylko jednej z dw&#243;ch list. Je&#347;li obie listy s&#261; podane, czarna lista b&#281;dzie ignorowana. Listy s&#261; wykorzystywane wy&#322;&#261;cznie podczas w&#322;&#261;czania funkcji, kt&#243;re s&#261; obs&#322;ugiwane przez procesy inne ni&#380; Explorer. W tym momencie te funkcje to: wsp&#243;lna nak&#322;adka ikony i zamienniki okien dialogowych kopiowania.<br>
<br>
Edycja ustawie&#324; za pomoc&#261; zasad grupy jest r&#243;wnie&#380; obs&#322;ugiwana. Rozpakuj plik <b>PolicyDefinitions.zip</b> znajduj&#261;cy si&#281; w folderze instalacji i przeczytaj dokument <b>PolicyDefinitions.rtf</b>, aby uzyska&#263; wi&#281;cej informacji.<br>
<br>

<br>

<h1><a name="dependencies"></a>Zale&#380;no&#347;ci od ustawie&#324; Windows<br>
</h1>
Niekt&#243;re ustawienia Classic Explorer wymagaj&#261; w&#322;&#261;czenia okre&#347;lonych ustawie&#324; systemu Windows:<br>
<ul>
  <li><span style="font-weight: bold;">Styl panelu nawigacji Windows Vista</span> - wymaga u&#380;ywania przez systemu Windows tematu podstawowego lub Aero</li>
  <li><span style="font-weight: bold;">Automatyczna nawigacja do wybranego folderu</span>
- to ustawienie mo&#380;na ustawi&#263; na "Zawsze" tylko wtedy, gdy w Eksploratorze jest w&#322;&#261;czona opcja "Automatycznie rozwi&#324; do bie&#380;&#261;cego folderu". Poszukaj jej w <span style="font-weight: bold;">Narz&#281;dzia -&gt; Opcje folder&#243;w -&gt;</span> zak&#322;adka <span style="font-weight: bold;">Og&#243;lne</span></li>
  <li><span style="font-weight: bold;">Poka&#380; napis na pasku tytu&#322;u</span>
- napis b&#281;dzie wy&#347;wietlany jako pe&#322;na nazwa &#347;cie&#380;ki lub tylko nazwa bie&#380;&#261;cego folderu. Aby wy&#347;wietli&#263; pe&#322;n&#261; &#347;cie&#380;k&#281; nale&#380;y w&#322;&#261;czy&#263; "Poka&#380; pe&#322;n&#261; &#347;cie&#380;k&#281; na pasku tytu&#322;u (tylko w motywie Classic)" w <span style="font-weight: bold;">Narz&#281;dzia -&gt; Opcje folder&#243;w -&gt;</span> zak&#322;adka <span style="font-weight: bold;">Widok</span></li>
  <li><span style="font-weight: bold;">Wszystkie ustawienia paska stanu</span> - wymagany jest widoczny pasek stanu (nie myli&#263; z okienkiem szczeg&#243;&#322;y). Sprawd&#378; w <span style="font-weight: bold;">Widok -&gt; Pasek stanu</span></li>
</ul>

<br>

<h1><a name="localization"></a>Lokalizacja j&#281;zykowa programu</h1>

Interfejs u&#380;ytkownika (z wyj&#261;tkiem okna dialogowego Ustawienia) jest przet&#322;umaczony na 35
j&#281;zyki.<br>

Okno dialogowe Ustawienia jest przet&#322;umaczone na mniejsz&#261; liczb&#281; j&#281;zyk&#243;w.
Domy&#347;lna instalacja jest dost&#281;pna tylko w j&#281;zyku angielskim. Inne j&#281;zyki mo&#380;na
pobra&#263; ze <a href="http://www.classicshell.net/translations/">strony t&#322;umaczenia</a>. Upewnij si&#281;, pobierasz pakiet t&#322;umaczenia zgodny z posiadan&#261; wersj&#261; programu Open-Shell.<br>

<span style="font-weight: bold;"></span><br>

</body></html>
