<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>










 <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>Classic IE</title>
<style type="text/css">
h1 {
  font-family: "Times New Roman",Times,serif;
  color: #0070c0;
}
p {
  font-family: Arial,Helvetica,sans-serif;
}
body {
  font-family: Arial,Helvetica,sans-serif;
}

</style></head><body>
<h1><a target="_blank" href="http://www.classicshell.net/"><img src="images/OpenShell.png" style="border: 0px solid ; width: 64px; height: 64px;" alt="Open-Shell website" title="Open-Shell website"></a>&nbsp;
Classic IE</h1><span style="font-style: italic; color: rgb(0, 112, 192); font-weight: bold;"></span><span style="color: rgb(79, 129, 189); font-weight: bold;"><br>
Classic IE</span>
jest
ma&#322;&#261; wtyczk&#261; dla Internet Explorer, kt&#243;ra:<br>
<ul>
  <li>Dodaje napis na pasku tytu&#322;u, dzi&#281;ki czemu mo&#380;na zobaczy&#263; pe&#322;ny tytu&#322; strony</li>
  <li>Pokazuje stref&#281; bezpiecze&#324;stwa w pasku stanu</li>
  <li>Pokazuje post&#281;p &#322;adowania na pasku stanu</li>
</ul>
<br>
Widok pe&#322;nego tytu&#322;u strony, nawet je&#347;li nie mie&#347;ci si&#281; on w zak&#322;adce:<br>
<br>
<img style="width: 748px; height: 190px;" alt="" src="images/ie9_caption.png"><br>
<br>Widok paska post&#281;pu i strefy bezpiecze&#324;stwa:<br><br>
<img style="width: 429px; height: 56px;" alt="" src="images/ie9_status.png"><br>
<br>
<h1><a name="install"></a>Instalacja</h1>
Podczas pierwszego uruchamiania przegl&#261;darki Internet Explorer po zainstalowaniu Classic IE mo&#380;esz zobaczy&#263; monit o zainstalowaniu nowego dodatku ClassicIEBHO i jego w&#322;&#261;czeniu. Je&#380;eli chcesz go w&#322;&#261;czy&#263; kliknij przycisk W&#322;&#261;cz. Je&#347;li nie otrzymasz monitu, przejd&#378; do <span style="font-weight: bold;">Narz&#281;dzia -&gt; Zarz&#261;dzaj dodatkami</span> i sprawd&#378; czy ClassicIEBHO jest w&#322;&#261;czony. Po w&#322;&#261;czeniu dodatku trzeba ponownie uruchomi&#263; program Internet Explorer, aby aktywowa&#263; wtyczk&#281;.<br>
<br>
<h1><a name="settings"></a>Ustawienia</h1>
Mo&#380;na uzyska&#263; dost&#281;p do ustawie&#324; z <span style="font-weight: bold;">Narz&#281;dzia -&gt; Ustawienia Classic IE</span>
lub z menu Start. Ustawienia steruj&#261; kolorem i czcionk&#261; napisu, oraz informacjami wy&#347;wietlanymi na pasku stanu.<br><br>
<img style="width: 683px; height: 438px;" alt="" src="images/ie9_settings.png"><br>
<br>Mo&#380;na wybra&#263; tylko widok podstawowych ustawie&#324; lub widok wszystkich dost&#281;pnych ustawie&#324;. Umieszczaj&#261;c wska&#378;nik myszy nad ka&#380;dym ustawieniem, mo&#380;na zobaczy&#263; jego kr&#243;tki opis. Wpisuj&#261;c w polu wyszukiwania nazw&#281; ustawienia, wyszukasz je wed&#322;ug nazwy.<br>
Ka&#380;de ustawienie ma warto&#347;&#263; domy&#347;ln&#261;. Warto&#347;&#263; domy&#347;lna mo&#380;e by&#263; sta&#322;a, lub mo&#380;e zale&#380;e&#263; od bie&#380;&#261;cych ustawie&#324; systemowych. Po modyfikacji to ustawienie staje si&#281; "zmodyfikowanym" i jest wy&#347;wietlane pogrubion&#261; czcionk&#261;. Aby powr&#243;ci&#263; do warto&#347;&#263; domy&#347;lnej, kliknij prawym przyciskiem myszy na ustawienie.
<br>

<br>
Mo&#380;na zapisa&#263; ustawienia do pliku XML, a p&#243;&#378;niej za&#322;adowa&#263; je z powrotem. Naciskaj&#261;c przycisk <span style="font-weight: bold;">Kopia zapasowa</span> uzyskasz dost&#281;p do tych funkcji. Stamt&#261;d mo&#380;na tak&#380;e zresetowa&#263; wszystkie ustawienia do ich warto&#347;ci domy&#347;lnych.<br>


<br>


Naci&#347;nij przycisk OK, aby zapisa&#263; ustawienia. Musisz ponownie uruchomi&#263; program Internet Explorer, aby zastosowa&#263; nowe ustawienia.<br>


<br>
<h1><a name="admin"></a>Ustawienia administracyjne</h1>
Administrator mo&#380;e zablokowa&#263; okre&#347;lone ustawienia, wi&#281;c &#380;aden u&#380;ytkownik nie b&#281;dzie m&#243;g&#322; ich edytowa&#263;. Osi&#261;ga si&#281; to przez dodanie odpowiednich ustawie&#324; w kluczu rejestru <span style="font-weight: bold;">HKEY_LOCAL_MACHINE\SOFTWARE\OpenShell\ClassicIE</span>.<br>
<br>
Mo&#380;na r&#243;wnie&#380; nie blokowa&#263; ustawienia, ale tylko zast&#261;pi&#263; jego pocz&#261;tkow&#261;
warto&#347;&#263;. Nale&#380;y doda&#263; "_Default" do nazwy warto&#347;ci rejestru.<br>
<br>
Najprostszym sposobem poznania nazwy ustawienia i jego warto&#347;ci w rejestrze, kt&#243;re chcesz zmodyfikowa&#263;, jest odszukanie go w kluczu <span style="font-weight: bold;">HKEY_CURRENT_USER\Software\OpenShell\ClassicIE\Settings</span>.<br>

Czasami mo&#380;esz chcie&#263; zablokowa&#263; warto&#347;&#263; domy&#347;ln&#261; ustawienia, ale nie znasz jej warto&#347;ci. W takim przypadku utw&#243;rz warto&#347;&#263; DWORD i ustaw jej warto&#347;&#263; na 0xDEFA.<br>

<br>

Istnieje r&#243;wnie&#380; ustawienie globalne <span style="font-weight: bold;">EnableSettings</span>. Ustawienie jego warto&#347;ci na 0 w rejestrze blokuje u&#380;ytkownikom mo&#380;liwo&#347;&#263; otworzenia okna dialogowego Ustawienia:<br><br>

<img style="width: 656px; height: 292px;" alt="" src="images/settings_disable_ie9.png"><br>
<br>
Edycja ustawie&#324; za pomoc&#261; zasad grupy jest r&#243;wnie&#380; obs&#322;ugiwana. Rozpakuj plik <b>PolicyDefinitions.zip</b> znajduj&#261;cy si&#281; w folderze instalacji i przeczytaj dokument <b>PolicyDefinitions.rtf</b>, aby uzyska&#263; wi&#281;cej informacji.<br>
<br>
</body></html>
