<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>








 <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>Open-Shell Menu</title>
<style type="text/css">
h1 {
  font-family: "Times New Roman",Times,serif;
  color: #0070c0;
}
p {
  font-family: Arial,Helvetica,sans-serif;
}
body {
  font-family: Arial,Helvetica,sans-serif;
}

</style></head><body><span style="font-weight: bold;"></span><span style="font-weight: bold;"></span>
<h1><a target="_blank" href="http://www.classicshell.net/"><img src="images/OpenShell.png" style="border: 0px solid ; width: 64px; height: 64px;" alt="Open-Shell website" title="Open-Shell website"></a>&nbsp;
Open-Shell Menu</h1><span style="font-style: italic; color: rgb(0, 112, 192); font-weight: bold;"></span><span style="color: rgb(79, 129, 189); font-weight: bold;"><br>
Open-Shell Menu</span>
jest elastycznym menu startowym, kt&#243;re mo&#380;e na&#347;ladowa&#263; zachowanie menu w systemie Windows 2000, XP i Windows 7. Posiada wiele zaawansowanych funkcji:
<ul>

  <li>Umo&#380;liwia wyb&#243;r mi&#281;dzy stylem &#8220;Klasycznym&#8221; a &#8220;Windows 7&#8221;<br>
</li>
  <li>Funkcja przeci&#261;gnij i upu&#347;&#263; pozwala uporz&#261dkowa&#263; aplikacje</li>

  <li>Opcje wy&#347;wietlania Ulubionych, rozwijania Panelu sterowania i itp.</li>
  <li>Pokazuje ostatnio u&#380;ywane dokumenty. Ilo&#347;&#263; wy&#347;wietlanych dokument&#243;w jest konfigurowalna</li>
  <li>Program zosta&#322; przet&#322;umaczony na 35 j&#281;zyk&#243;w i obs&#322;uguje czytanie od prawej do lewej
dla j&#281;zyk&#243;w arabskiego i hebrajskiego</li>
  <li>Nie wy&#322;&#261;cza oryginalnego menu Start w systemie Windows. Mo&#380;na uzyska&#263; do niego dost&#281;p przez Shift + klikni&#281;cie na przycisk start</li>
  <li>Klikni&#281;cie prawym przyciskiem myszy na pozycji w menu umo&#380;liwia usuni&#281;cie, zmian&#281; nazwy, sortowanie, lub
wykonywanie innych zada&#324;</li>
  <li>Pole wyszukiwania umo&#380;liwia wyszukiwanie program&#243;w i plik&#243;w  bez u&#380;ywania do tego skr&#243;t&#243;w klawiaturowych </li>
  <li>Obs&#322;uguje listy szybkiego dost&#281;pu w celu uzyskania &#322;atwego dost&#281;pu do najnowszych dokument&#243;w i wsp&#243;lnych zada&#324;</li>
  <li>Dost&#281;pny dla 32 i 64-bitowych system&#243;w operacyjnych</li>
  <li>Umo&#380;liwia obs&#322;ug&#281; karnacji, w tym dodatkowych karnacji innych firm . Wykonaj w&#322;asne karnacje!</li>
  <li>W pe&#322;ni konfigurowalne funkcje jak i wygl&#261;d</li>
  <li>Wsparcie dla programu Microsoft Active Accessibility (aktywne u&#322;atwienie dost&#281;pu)</li>
  <li>Przekszta&#322;ca przycisk &#8220;Wszystkie programy&#8221; w menu Windows na menu kaskadowe</li>
  <li>Wdra&#380;a konfigurowalny przycisk start<br>
</li>
  <li>Mo&#380;na wy&#347;wietla&#263;, wyszukiwa&#263; i uruchamia&#263; aplikacje Windows Store (Windows 8)</li>




<li>I ostatnie, ale nie mniej wa&#380;ne  &#8211; to nic nie kosztuje!</li>
</ul><br>
<h1><a name="styles"></a> Style</h1>
Menu start oferuje do wyboru 3 style.<br>
<h3>1) Styl klasyczny z jedn&#261; kolumn&#261;</h3>
<img src="images/style1.png" style="width: 640px; height: 550px;" alt=""><br>
<br>
Ten styl jest podobny do menu dost&#281;pnego w Windows 2000. Posiada jedn&#261; kolumn&#281; w menu g&#322;&#243;wnym z pionowym tekstem. Mo&#380;na dostosowa&#263; kolejno&#347;&#263; element&#243;w, ikony i tekst.<br>

Programy, listy szybkiego dost&#281;pu i wyniki wyszukiwania wy&#347;wietlane s&#261; jako kaskadowe podmenu.<br>

<br>
<h3>2) Styl klasyczny z dwiema kolumnami</h3>
<img src="images/style2.png" style="width: 640px; height: 550px;" alt=""><br>
 <br>
Ten styl jest podobny do menu Windows XP. S&#261; dwie kolumny
gdzie mo&#380;na rozmie&#347;ci&#263; pozycje menu. Dostosowa&#263; kolejno&#347;&#263;, ikony i
tekst.<br>
Programy, listy szybkiego dost&#281;pu i wyniki wyszukiwania wy&#347;wietlane s&#261; jako kaskadowe podmenu.<br>
<br>
<h3>3) Styl Windows 7<br>
</h3>
<img src="images/style3.png" style="width: 640px; height: 550px;" alt=""><br>
<br>
Ten styl jest podobny do menu Windows Vista i Windows 7. Pozycje w pierwszej kolumnie s&#261; predefiniowane do przypi&#281;tych i niedawno u&#380;ywanych program&#243;w, 
listy wszystkie programy i pola wyszukiwania. Pozycje w drugiej
kolumnie s&#261; w pe&#322;ni konfigurowalne.<br>
Listy szybkiego dost&#281;pu i wyniki wyszukiwania wy&#347;wietlane s&#261; wewn&#261;trz g&#322;&#243;wnego menu. Programy mog&#261; by&#263; wewn&#261;trz g&#322;&#243;wnego menu lub otwarte jako kaskadowe podmenu.<br>
Ten styl oferuje mniej opcji dostosowywania ni&#380; style klasyczne, ale
ma wygl&#261;d i dzia&#322;anie bardziej znane ludziom, kt&#243;rzy u&#380;ywali Windows 7.<br>
<br>
<br>
<h1><a name="operation"></a> Operacje</h1>
Je&#347;li korzysta&#322;e&#347; z menu Start w starszych wersjach systemu Windows, b&#281;dziesz czu&#263; si&#281; jak w domu:<br>



<p>
Naci&#347;nij klawisz Windows lub kliknij ikon&#281; w rogu ekranu, aby otworzy&#263; menu Start.</p>
<p>
Przytrzymaj wci&#347;ni&#281;ty klawisz Shift podczas klikania na ikon&#281;, aby uzyska&#263; dost&#281;p do menu start w&#322;asnego systemu operacyjnego.
</p>
<p>
Kliknij na element, aby go uruchomi&#263;.
</p>
<p>
Przeci&#261;gnij program, aby zmieni&#263; kolejno&#347;&#263; w menu programy, lub
przenie&#347;&#263; go do innego folderu.
</p>
<p>
Kliknij prawym przyciskiem myszy na elemencie, aby zmieni&#263; jego nazw&#281;, usun&#261;&#263; go, eksplorowa&#263; go, sortowa&#263; menu lub wykona&#263; inne zadania.</p>
<p>
Kliknij prawym przyciskiem myszy na ikon&#281; menu Start, aby edytowa&#263; ustawienia Open-Shell Menu, wy&#347;wietli&#263; plik pomocy, lub
zako&#324;czy&#263; prac&#281; programu.<br>
</p>
<p><br>

</p>

<h1><a name="settings"></a>
Ustawienia</h1>Kliknij prawym przyciskiem myszy na przycisk Start, aby uzyska&#263; dost&#281;p do ustawie&#324;:<br>
  </li>
</ul>
<img src="images/settings1.png" style="width: 688px; height: 472px;" alt=""><br>
<br>
Mo&#380;na wybra&#263; tylko widok podstawowych ustawie&#324;, lub wszystkich dost&#281;pnych
ustawie&#324;. Umieszczaj&#261;c wska&#378;nik myszy nad ka&#380;dym ustawieniem, mo&#380;na zobaczy&#263; jego kr&#243;tki opis. Wpisuj&#261;c w polu wyszukiwania nazw&#281; ustawienia, wyszukasz je wed&#322;ug nazwy.<br>

Ka&#380;de ustawienie ma warto&#347;&#263; domy&#347;ln&#261;. Warto&#347;&#263; domy&#347;lna mo&#380;e by&#263; sta&#322;a,
lub mo&#380;e zale&#380;e&#263; od bie&#380;&#261;cych ustawie&#324; systemowych. Po modyfikacji to
ustawienie staje si&#281; "zmodyfikowanym" i jest wy&#347;wietlane pogrubion&#261; czcionk&#261;. Aby powr&#243;ci&#263; do
warto&#347;&#263; domy&#347;lnej, kliknij prawym przyciskiem myszy na ustawienie.<br>
<br>

Mo&#380;na zapisa&#263; ustawienia do pliku XML, a p&#243;&#378;niej za&#322;adowa&#263; je z powrotem.
Naciskaj&#261;c przycisk Kopia zapasowa uzyskasz dost&#281;p do tych funkcji. Stamt&#261;d mo&#380;na
tak&#380;e zresetowa&#263; wszystkie ustawienia do ich warto&#347;ci domy&#347;lnych.<br>


<br>

Wi&#281;kszo&#347;&#263; ustawie&#324; zmienia si&#281; natychmiast podczas ich modyfikacji. Na przyk&#322;ad
mo&#380;na zmodyfikowa&#263; menu Start, a nast&#281;pnie gdy jest otwarte okno dialogowe Ustawienia, przej&#347;&#263; do menu Start, aby zobaczy&#263; wprowadzone zmiany. Niewielka liczba ustawie&#324; b&#281;dzie
wymaga&#263; ponownego uruchomienia Menu start, aby wprowadzi&#263; dokonane zmian<br>

<br>


<span style="font-weight: bold;">Uwaga:</span> Okno Wszystkie ustawienia jest skalowalne. Mo&#380;na zmienia&#263; jego rozmiary i umieszcza&#263; w wybranym po&#322;o&#380;eniu. Okno zapami&#281;ta swoj&#261; now&#261; pozycj&#281;.<br>


<br>
Kliknij na zak&#322;adk&#281; <span style="font-weight: bold;">Dostosuj menu Start</span>, aby dostosowa&#263; elementy menu. W zale&#380;no&#347;ci od u&#380;ywanego stylu zobaczysz r&#243;&#380;ne interfejsy u&#380;ytkownika.<br>
<br>
W stylach klasycznych mo&#380;na dostosowa&#263; zar&#243;wno kolumny w menu start jak i tworzone podmenu. W lewej kolumnie wy&#347;wietlane s&#261; aktualne pozycje w menu za&#347; w prawej kolumnie wy&#347;wietlane s&#261; wszystkie dost&#281;pne elementy menu. Przeci&#261;gnij element z prawej do lewej kolumny, aby doda&#263; go do menu.<br>
<br>
<img src="images/settings3.png" style="width: 688px; height: 472px;" alt=""><br>
<br>
W stylu Windows 7 mo&#380;na modyfikowa&#263; tylko elementy b&#281;d&#261;ce w drugiej kolumnie i brak jest podmenu.<br>
<br>
<img src="images/settings2.png" style="width: 688px; height: 472px;" alt=""><br>
<br><br>
Kliknij dwukrotnie ikon&#281; elementu, aby edytowa&#263; jego w&#322;a&#347;ciwo&#347;ci:<br>
<br>
<img src="images/settings4.png" style="width: 452px; height: 482px;" alt=""><br>
<br>
Tutaj mo&#380;na wybra&#263; polecenie dla elementu, jego tekst, ikon&#281; i inne atrybuty. Naci&#347;nij przycisk <span style="font-weight: bold;">Przywr&#243;&#263; domy&#347;lne</span>, aby uzyska&#263; domy&#347;lny tekst i ikon&#281; dla wybranego polecenia.<br>
<br>
Poleceniem mo&#380;e by&#263;:<br>

<ul>
<li><span style="font-weight: bold;">jedno z predefiniowanych polece&#324;</span> - z rozwijanej listy</li><li><span style="font-weight: bold;">niestandardowy ci&#261;g wykonywalny</span>
- mo&#380;e to by&#263; nazwa programu i jego argumenty, a nawet adres URL (np. http://www.google.com). Zmienne &#347;rodowiskowe, takie jak %SystemRoot% s&#261; obs&#322;ugiwane</li><li><span style="font-weight: bold;">pozostawiono puste</span> - je&#347;li jest stosowany atrybut &#322;&#261;cze, to b&#281;dzie dzia&#322;a&#263; jako polecenie<br>
  </li>
</ul>
&#321;&#261;cze mo&#380;e by&#263; &#347;cie&#380;k&#261; do pliku lub folderu. Je&#347;li jest to plik, plik zostanie wykonany. Je&#347;li to jest folder, folder zostanie otworzony w podmenu. Niekt&#243;re pozycje menu (takie jak Programy i Ulubione) maj&#261; niejawny atrybut &#322;&#261;cza, wi&#281;c dla nich pole &#321;&#261;cze zostanie wy&#322;&#261;czone.<br>

<br>

Ikon&#261; mo&#380;e by&#263;:<br style="font-weight: bold;">

<ul>
<li><span style="font-weight: bold;">pozostawiono puste</span> - je&#347;li atrybut &#322;&#261;cza wskazuje na plik lub folder, to zostanie u&#380;yta ikona pliku lub folderu<br>
    <span style="font-weight: bold;"></span></li><li><span style="font-weight: bold;">plik zasob&#243;w, ID ikony</span> - na przyk&#322;ad <span style="font-weight: bold;">%windir%\notepad.exe,2</span>. Nie nale&#380;y pozostawia&#263; spacji mi&#281;dzy nazw&#261; pliku a przecinkiem. <span style="font-weight: bold;">Upewnij si&#281;, &#380;e u&#380;ywasz identyfikatora zasobu ikony, a nie indeksu ikony.</span> Aby uzyska&#263; najlepsze rezultaty nale&#380;y u&#380;y&#263; przycisku <span style="font-weight: bold;">[...]</span> umieszczonego przy polu Ikona<br>
</li><li><span style="font-weight: bold;">ID ikony</span> - jak wy&#380;ej, ale plikiem zasob&#243;w jest <span style="font-weight: bold;">StartMenuDLL.dll</span>. Jest to przydatne, gdy odnosi si&#281; do ikon w&#322;asnych menu Start<br>
  </li><li><span style="font-weight: bold;">plik ikony</span> -&nbsp; na przyk&#322;ad <span style="font-weight: bold;">C:\Program Files\Mozilla Thunderbird\Email.ico</span></li><li><span style="font-weight: bold;">brak</span> - zostanie u&#380;yta pusta ikona</li>
</ul>
Je&#380;eli atrybut etykiety lub porady rozpoczyna si&#281; znakiem <span style="font-weight: bold;">$</span> (znak dolara), wtedy system b&#281;dzie traktowa&#263; go jako nazw&#281; ci&#261;gu w pliku <span style="font-weight: bold;">StartMenuL10N.ini</span>. Rzeczywisty tekst zale&#380;y od bie&#380;&#261;cego ustawienia j&#281;zyka. Jest to przydatne podczas tworzenia menu, kt&#243;re mo&#380;e by&#263; u&#380;ywane przez wiele j&#281;zyk&#243;w.<br>
<br>
Je&#347;li zaznaczysz pole wyboru "Wstaw podpozycje jako przyciski", zamiast wy&#347;wietlenia samej pozycji menu, menu start poka&#380;e podelementy jako rz&#261;d przycisk&#243;w. Domy&#347;lnie przyciski s&#261; wy&#347;rodkowane. Mo&#380;na wyr&#243;wna&#263; je do lewej dodaj&#261;c separator jako ostatni&#261; pozycj&#281;, lub wyr&#243;wna&#263; je do prawej poprzez dodanie separatora jako pierwsz&#261; pozycj&#281;. Jednym z mo&#380;liwych zastosowa&#324; jest zast&#261;pienie menu zamykania systemu z oddzielnymi przyciskami Zamknij, Uruchom ponownie, Wyloguj, itp.<br>
<br>
<h1><a name="admin"></a>Ustawienia administracyjne</h1>
Ustawienia dotycz&#261; poszczeg&#243;lnych u&#380;ytkownik&#243;w i przechowywane s&#261; w rejestrze. Domy&#347;lnie ka&#380;dy u&#380;ytkownik mo&#380;e edytowa&#263;
wszystkie swoje ustawienia. Administrator mo&#380;e zablokowa&#263; okre&#347;lone ustawienia, wi&#281;c &#380;aden u&#380;ytkownik nie b&#281;dzie m&#243;g&#322; ich edytowa&#263;:<br>
<br>
<img src="images/settings5.png" style="width: 688px; height: 472px;" alt=""><br>
<br>
W tym przyk&#322;adzie ustawienie "W&#322;&#261;cz menu kontekstowe" jest zablokowane, tak aby pole wyboru zawsze
by&#322;o odznaczone i nie mog&#322;o by&#263; zmienione przez dowolnego u&#380;ytkownika. Osi&#261;ga si&#281; to przez
dodanie odpowiednich ustawie&#324; w kluczu rejestru <span style="font-weight: bold;">HKEY_LOCAL_MACHINE\SOFTWARE\OpenShell\Menu</span>. Nale&#380;y utworzy&#263; warto&#347;&#263; DWORD o nazwie "EnableContextMenu" i ustawi&#263; jej warto&#347;&#263; na 0.<br>
<br>
W niekt&#243;rych przypadkach mo&#380;esz nie chcie&#263; zablokowa&#263; warto&#347;ci dla wszystkich u&#380;ytkownik&#243;w, ale
jedynie chcesz zmieni&#263; pocz&#261;tkow&#261; warto&#347;&#263; ustawienia. W takim przypadku nale&#380;y doda&#263;
"_Default" do nazwy warto&#347;ci. Na przyk&#322;ad, aby menu kontekstowe
by&#322;o domy&#347;lnie wy&#322;&#261;czone, ale u&#380;ytkownicy mieli nadal mo&#380;liwo&#347;&#263; w&#322;&#261;czenia go,
gdy tego chc&#261;, nale&#380;y utworzy&#263; warto&#347;&#263; DWORD o nazwie "EnableContextMenu_Default"
i ustawi&#263; jej warto&#347;&#263; na 0.<br>
<br>
Najprostszym sposobem poznania nazwy ustawienia i jego warto&#347;ci w rejestrze, kt&#243;re chcesz zmodyfikowa&#263;, jest odszukanie go w kluczu <span style="font-weight: bold;">HKEY_CURRENT_USER\Software\OpenShell\StartMenu\Settings</span>.<br>

Czasem mo&#380;esz chcie&#263; zablokowa&#263; warto&#347;&#263; domy&#347;ln&#261; ustawienia, ale nie znasz jej warto&#347;ci. W takim przypadku utw&#243;rz warto&#347;&#263; DWORD i ustaw jej warto&#347;&#263; na 0xDEFA.<br>

<br>

Istnieje r&#243;wnie&#380; ustawienie globalne "EnableSettings". Ustawienie jego warto&#347;ci na 0 w rejestrze blokuje u&#380;ytkownikom mo&#380;liwo&#347;&#263; otworzenia okna dialogowego Ustawienia:<br>
<br>
<img style="width: 656px; height: 292px;" alt="" src="images/settings_disable_sm.png"><br>
<br>
Menu start sprawdza r&#243;wnie&#380; wi&#281;kszo&#347;&#263; zasad grupy, ustawianych przez administratora. Uruchom <strong style="color: rgb(0, 112, 192);">gpedit.msc</strong> i przejd&#378; do <strong style="color: rgb(0, 112, 192);">Konfiguracja u&#380;ytkownika -&gt; Szablony administracyjne -&gt; Menu Start i pasek zada&#324;</strong>. Mo&#380;na stamt&#261;d wy&#322;&#261;czy&#263; Uruchom, Zamknij, Pomoc i inne funkcje. <span style="font-style: italic;">(Niedost&#281;pne w wersjach Home systemu Windows)</span>.<br>
<br>
Edycja ustawie&#324; za pomoc&#261; zasad grupy jest r&#243;wnie&#380; obs&#322;ugiwana. Rozpakuj plik <b>PolicyDefinitions.zip</b> znajduj&#261;cy si&#281; w folderze instalacji i przeczytaj dokument <b>PolicyDefinitions.rtf</b>, aby uzyska&#263; wi&#281;cej informacji.<br>
<br>
<br>
<h1><a name="skins"></a>Karnacje</h1>
Mo&#380;na wybra&#263; jedn&#261; z wielu zainstalowanych karnacji:<br>
<br>
<img src="images/skins.gif" style="width: 250px; height: 470px;" alt="Skins for Open-Shell Menu" title="Skins for Open-Shell Menu"><br>
<br>Lub mo&#380;na pobra&#263; i zainstalowa&#263; dodatkowe karnacje innych firm (z g&#322;&#243;wnej strony internetowej lub z innego miejsca). Po pobraniu nowej karnacji nale&#380;y skopiowa&#263; plik <span style="font-weight: bold;">.skin</span> do katalogu Skins &#8211; z regu&#322;y do <span style="font-weight: bold; color: rgb(79, 129, 189);">C:\Program
Files\Open-Shell\Skins</span>. Po tym karnacja b&#281;dzie dost&#281;pna w ustawieniach.<br>
<br>
<strong>Uwaga:</strong> Niekt&#243;re karnacje mog&#261; by&#263; specjalnie zaprojektowane dla
trybu Klasycznego, Podstawowego, lub Aero. Na przyk&#322;ad karnacja Aero mo&#380;e wymaga&#263;
obs&#322;ugi dowolnego szk&#322;a i b&#281;dzie wygl&#261;da&#263; dziwnie, je&#347;li jest
wybrany motyw Klasyczny lub Podstawowy. Niekt&#243;re karnacje Aero mog&#261; r&#243;wnie&#380; wymaga&#263; wybrania okre&#347;lonego koloru szk&#322;a.<br>
<br>
Mo&#380;na utworzy&#263; w&#322;asn&#261; karnacj&#281;. Do tego b&#281;dzie potrzebny edytora obraz&#243;w, kt&#243;ry
obs&#322;uguje kana&#322; alfa (np. Gimp lub Photoshop) oraz narz&#281;dzie do edycji
plik&#243;w zasob&#243;w (jak Resource Hacker lub Visual Studio). I oczywi&#347;cie posiadanie
talentu projektowania graficznego.<br> Przed rozpocz&#281;ciem przeczytaj <a target="_blank" href="http://www.classicshell.net/tutorials/skintutorial.html">Samouczek tworzenia karnacji</a>.<br>
<br>
<br><br>
<h1><a name="search"></a>Wyszukiwanie</h1><img src="images/search1.png" style="width: 403px; height: 452px;" alt=""><br>
<br>
 Pole wyszukiwania umo&#380;liwia wyszukiwanie w zawarto&#347;ci menu Start,
program&#243;w o zmiennej &#347;rodowiskowej PATH i w indeksowanych plikach. Pole wyszukiwania mo&#380;e by&#263;
wy&#347;wietlane jako normalny element menu i mo&#380;na przej&#347;&#263; do niego za pomoc&#261;
klawiszy strza&#322;ek g&#243;ra/d&#243;&#322;. Mo&#380;na wybra&#263;, aby domy&#347;lnie pole wyszukiwania by&#322;o
aktywne po otwarciu menu start. Mo&#380;na te&#380; wybra&#263;, aby pole wyszukiwania by&#322;o dost&#281;pne 
tylko za pomoc&#261; klawisza Tab, wi&#281;c do momentu naci&#347;ni&#281;cia Tab mo&#380;na u&#380;ywa&#263;
klawiatury do nawigacji, jako &#380;e pola wyszukiwania nie ma.<br>
<br>
Wyniki wyszukiwania wy&#347;wietlane s&#261; w menu g&#322;&#243;wnym, je&#347;li u&#380;ywasz stylu Windows 7 lub w podmenu w stylach klasycznych.<br>
Kliknij kategori&#281;, aby j&#261; rozwin&#261;&#263; i wy&#347;wietli&#263; wi&#281;cej wynik&#243;w. Kliknij ikon&#281; na ko&#324;cu, aby wy&#347;wietli&#263; wszystkie wyniki w Eksploratorze.<br>
<br>
Style klasyczne umo&#380;liwiaj&#261; u&#380;ywanie dodatkowych wyszukiwarek, kt&#243;re mo&#380;na wykorzysta&#263; do
wyszukiwania tekstu przy pomocy pola wyszukiwania. Program wyszukiwarki mo&#380;na uruchomi&#263;
wybieraj&#261;c go z menu, lub
naciskaj&#261;c Alt+klawisz. W tym przyk&#322;adzie, aby uruchomi&#263; Agent Ransack nale&#380;y u&#380;y&#263; Alt+A.<br>
<br>
<img src="images/search2.png" style="width: 412px; height: 345px;" alt=""><br>
<br>
Odbywa si&#281; to poprzez dodanie podelementu do pola wyszukiwania w zak&#322;adce <span style="font-weight: bold;">Dostosuj menu Start</span>:<br>
<br>
<img src="images/search3.png" style="width: 347px; height: 197px;" alt=""><br>
<br>
Otw&#243;rz ka&#380;dy z podelement&#243;w i wprowadzi&#263; polecenie, aby uruchomi&#263; program wyszukiwarki. Je&#347;li u&#380;yjesz <span style="font-weight: bold;">%1</span> w poleceniu, zostanie ono zast&#261;pione przez zawarto&#347;&#263; pola wyszukiwania. Je&#347;li u&#380;yjesz <span style="font-weight: bold;">%2</span>
zostanie ono zast&#261;pione przez zakodowany tekst wyszukiwania adresu url. Wprowad&#378; etykiet&#281;, porad&#281; i ikon&#281;, aby zako&#324;czy&#263; wpis w menu. W tek&#347;cie etykiety mo&#380;na u&#380;y&#263; <span style="font-weight: bold;">&amp;</span>, aby zaznaczy&#263; liter&#281; akceleratora (na przyk&#322;ad <span style="font-weight: bold;">&amp;Agent Ransack</span>).<br>
<br>
Oto kilka mo&#380;liwych polece&#324;:<br>
Szukaj z Agent Ransack: <span style="font-weight: bold;">"C:\Program Files\Agent Ransack\AgentRansack.exe" -r -f "%1"</span><br>
Szukaj z Everything: <span style="font-weight: bold;">"C:\Program Files\Everything\Everything.exe" -search "%1"</span><br>
Szukaj z Google: <span style="font-weight: bold;">http://www.google.com/#q=%2</span><br>
Szukaj z Bing: <span style="font-weight: bold;">http://www.bing.com/search?q=%2</span><br>
<br>
<br>
<h1><a name="button"></a>Niestandardowy przycisk Start<br>
</h1>Open-Shell mo&#380;e doda&#263; sw&#243;j w&#322;asny przycisk Start na pasku zada&#324;. On mo&#380;e
zast&#261;pi&#263; nawet domy&#347;lny przycisk Start w Windows 7. Mo&#380;na wybra&#263; "muszelk&#281;"
ze stylu Aero, klasyczny prostok&#261;tny przycisk, lub
mo&#380;na utworzy&#263; w&#322;asny. Dla niestandardowego przycisku Start potrzebny jest obraz, kt&#243;ry
b&#281;dzie zawiera&#322; 3 stany przycisku - normalny, gor&#261;cy i wci&#347;ni&#281;ty:<br>
<br>
<img src="images%5Cbutton_images.png" style="width: 64px; height: 192px;" alt="Start button images" title="Start button images"><br>
<br>
Obraz musi by&#263; 32-bitowym PNG lub BMP. Domy&#347;lnie szeroko&#347;&#263;
obrazu okre&#347;la rozmiar przycisku. Rozmiar przycisku mo&#380;na zmieni&#263; przez
wprowadzenie niestandardowej szeroko&#347;ci.<br>
W internecie mo&#380;na znale&#378;&#263; wiele obraz&#243;w niestandardowych przycisk&#243;w Start. Oto kilka przyk&#322;ad&#243;w:<br>
<a href="http://www.classicshell.net/forum/viewforum.php?f=18">http://www.classicshell.net/forum/viewforum.php?f=18</a><br>
<a target="_blank" href="http://www.sevenforums.com/themes-styles/34951-custom-start-menu-button-collection.html">http://www.sevenforums.com/themes-styles/34951-custom-start-menu-button-collection.html<br>
</a><a target="_blank" href="http://www.sevenforums.com/customization/78291-big-group-custom-start-orbs.html">http://www.sevenforums.com/customization/78291-big-group-custom-start-orbs.html</a><br>
<a target="_blank" href="http://tutoriales13.deviantart.com/art/Orbs-153450418">http://tutoriales13.deviantart.com/art/Orbs-153450418</a><br>
<br>
<br>
<h1><a name="localization"></a>Lokalizacja j&#281;zykowa programu</h1>

Interfejs u&#380;ytkownika (z wyj&#261;tkiem okna dialogowego Ustawienia) jest przet&#322;umaczony na 35
j&#281;zyki.<br>

Okno dialogowe Ustawienia jest przet&#322;umaczone na mniejsz&#261; liczb&#281; j&#281;zyk&#243;w.
Domy&#347;lna instalacja jest dost&#281;pna tylko w j&#281;zyku angielskim. Inne j&#281;zyki mo&#380;na
pobra&#263; ze <a href="http://www.classicshell.net/translations/">strony t&#322;umaczenia</a>. Upewnij si&#281;, pobierasz pakiet t&#322;umaczenia zgodny z posiadan&#261; wersj&#261; programu Open-Shell.<br>


<br>
<br><h1><a name="command_line"></a>Wiersz polecenia</h1>
<span style="font-weight: bold; color: rgb(0, 112, 192);">StartMenu.exe</span> obs&#322;uguje 5 parametr&#243;w wiersza polece&#324;: <span style="font-weight: bold; color: rgb(0, 112, 192);">-open</span>, <span style="font-weight: bold; color: rgb(0, 112, 192);">-toggle</span>, <span style="font-weight: bold; color: rgb(0, 112, 192);">-togglenew</span>, <span style="font-weight: bold; color: rgb(0, 112, 192);">-exit </span>i <span style="font-weight: bold; color: rgb(0, 112, 192);">-settings</span>.<br>
<br>
Dwa pierwsze wykonuj&#261; to, co sugeruje nazwa. Pierwszy otwiera klasyczne menu start, drugi prze&#322;&#261;cza je. Mo&#380;na u&#380;ywa&#263; parametr&#243;w, aby utworzy&#263; skr&#243;t na pasku szybkiego uruchamiania, kt&#243;ry otwiera menu start, lub ustawi&#263; klawisz szybkiego dost&#281;pu do program&#243;w takich jak <a target="_blank" href="http://www.softpedia.com/get/System/OS-Enhancements/WinKey.shtml">WinKey</a>.<br>
<br>
Trzeci "-togglenew" prze&#322;&#261;cza domy&#347;lne menu Start systemu Windows (lub ekran startowy). Jest to przydatne, gdy chce si&#281; utworzy&#263; skr&#243;t lub klawisz szybkiego dost&#281;pu, aby otwiera&#263; domy&#347;lne menu i u&#380;ywa&#263; klawisza Win dla klasycznego menu.<br>
<br>
U&#380;yj "-exit", aby zako&#324;czy&#263; prac&#281; programu Menu Start. Komenda ta dzia&#322;a tylko wtedy, gdy menu start nie jest obecnie zaj&#281;te.<br>
<br>
U&#380;yj "-settings", aby otworzy&#263; ustawienia Menu Start. Jest to przydatne, aby utworzy&#263; skr&#243;t do edycji ustawie&#324;.<br>
<br>
<br>
<h1><a name="accessibility"></a>U&#322;atwienia dost&#281;pu</h1>Menu Start obs&#322;uguje czytniki ekranu jak JAWS lub Microsoft Narrator. Je&#347;li obs&#322;uga dost&#281;pno&#347;ci sprawia problemy mo&#380;na j&#261; wy&#322;&#261;czy&#263; w Ustawieniach w karcie <span style="font-weight: bold;">Zachowanie</span>.<br>

<br>
</body></html>
