<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>



  <meta content="text/html; charset=iso-8859-1" http-equiv="content-type"><title>Classic Explorer</title>
  <style type="text/css">h1 { color: #0070c0; font-family: &quot;Times New Roman&quot;,Times,serif; } body { font-family: Arial,Helvetica,sans-serif; }</style></head><body>
<h1><a target="_blank" href="http://www.classicshell.net/"><img src="images/OpenShell.png" style="border: 0px solid ; width: 64px; height: 64px;" alt="&#1042;&#1077;&#1073;-&#1091;&#1079;&#1077;&#1083; Open-Shell" title="&#1042;&#1077;&#1073;-&#1091;&#1079;&#1077;&#1083; Open-Shell "></a>&nbsp; Classic Explorer</h1><span style="font-style: italic; color: rgb(0, 112, 192); font-weight: bold;"></span><br> <span style="font-weight: bold; color: rgb(79, 129, 189);">Classic Explorer</span> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; Windows, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;:<ul>

  <li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;
&#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1097;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; (&#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1074;
&#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091;, &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;, &#1050;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100;, &#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;, &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;,
&#1069;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1095;&#1090;&#1072;). &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103;</li>
  <li>&#1047;&#1072;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; Windows 7 &#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; «&#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102;» &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1087;&#1086;&#1093;&#1086;&#1078;&#1091;&#1102; &#1085;&#1072; Windows XP</li>
  
  <li>&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; Alt+Enter &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1072;&#1087;&#1086;&#1082; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;
Windows, &#1075;&#1076;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080;</li>

  <li>&#1042;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1072;&#1087;&#1086;&#1082; &#1082;&#1072;&#1082; &#1074; Windows XP &#1073;&#1077;&#1079; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103;</li>
  <li>&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080; &#1086;&#1073;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;</li>
  <li>&#1052;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1091;&#1090;&#1077;&#1081; &#1074; &#1072;&#1076;&#1088;&#1077;&#1089;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;</li>
  <li>&#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;
&#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1074; Windows 7 - &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077;
&#1079;&#1085;&#1072;&#1095;&#1082;&#1072; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1086;&#1073;&#1097;&#1080;&#1093; &#1087;&#1072;&#1087;&#1082;&#1072;&#1093;, &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1099; &#1087;&#1072;&#1087;&#1086;&#1082; &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;
&#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074;, &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;, &#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077;<br></li>




</ul><br><h1><a name="copy"></a>&#1053;&#1086;&#1074;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; Windows 7)<br></h1>&#1055;&#1088;&#1080; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; Windows 7 &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;:<br> <br> <img src="images/before.png" style="width: 460px; height: 472px;" alt="&#1044;&#1086;" title="&#1044;&#1086;"><br><p>&#1063;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1083;&#1086;&#1089;&#1100; &#1089; &#1085;&#1080;&#1084;?</p>

<p>&#1053;&#1091;, &#1076;&#1083;&#1103; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072;, &#1101;&#1090;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1091; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;, &#1080;
&#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1086;&#1082;&#1072; &#1074;&#1089;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1103;&#1089;&#1085;&#1086;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077;
&#1103;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1084;&#1099;&#1096;&#1080; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1082;&#1072;&#1082; &#1074; &#1087;&#1088;&#1080;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080;&#1075;&#1088;
Lucas Arts.a <a target="_blank" href="http://en.wikipedia.org/wiki/Day_of_the_Tentacle"> &#1082;&#1072;&#1082; &#1074; &#1087;&#1088;&#1080;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080;&#1075;&#1088; Lucas Arts</a>. &#1048;, &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1082;&#1088;&#1072;&#1081;&#1085;&#1077; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1077; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;. &#1053;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1090;&#1090;&#1100; <span style="font-weight: bold; color: rgb(79, 129, 189);">&#8220;&#1044;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099;&#8221;</span>, &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <strong><span style="color: rgb(79, 129, 189);">Alt+D, up, up, up, Space</span></strong>! &#1069;&#1090;&#1086; &#1089;&#1083;&#1086;&#1078;&#1085;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <a target="_blank" href="http://www.youtube.com/watch?v=AErqKebdqjU&amp;feature=fvw">&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; Akuma Kara Demon</a> &#1074; &#1080;&#1075;&#1088;&#1077; Street Fighter 3. &#1047;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1087;&#1088;&#1080; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</p>

<p>&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; &#1082;&#1083;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; &#1074; &#1089;&#1090;&#1080;&#1083;&#1077; Windows XP:<br></p>

<p><img src="images/after.png" style="width: 438px; height: 251px;" alt="&#1055;&#1086;&#1089;&#1083;&#1077;" title="&#1055;&#1086;&#1089;&#1083;&#1077;"><br></p>

<p>&#1057;&#1088;&#1072;&#1079;&#1091; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1080;&#1085;&#1090;&#1091;&#1080;&#1074;&#1085;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;&#1077; <span style="font-style: italic;">(&#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; - &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;)</span>, &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1085;&#1072;&#1074;&#1080;&#1075;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1086;&#1081; (&#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <span style="font-weight: bold; color: rgb(79, 129, 189);">Y</span> &#1076;&#1083;&#1103; &#8220;&#1044;&#1072;&#8221;, <span style="font-weight: bold; color: rgb(79, 129, 189);">,</span>
&#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;), &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1085;&#1086;&#1074;&#1077;&#1077; &#1080;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077;. &#1048;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1080; &#1074; Windows XP, &#1091;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; <strong style="color: rgb(79, 129, 189);">Shift</strong> &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1053;&#1077;&#1090;" &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; "&#1053;&#1077;&#1090; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093;" <strong style="color: rgb(79, 129, 189);">Shift+N</strong>).<br></p>

<p>&#1045;&#1089;&#1083;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; <span style="text-decoration: underline;">&#1055;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077;&#8230;</span>
&#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; Windows. &#1054;&#1090;&#1090;&#1091;&#1076;&#1072; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1074;&#1089;&#1077;
&#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1091; "&#1050;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;".</p>
<p><span style="font-weight: bold;">&#1042;&#1072;&#1078;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</span> &#1048;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;. &#1053;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1074;&#1083;&#1080;&#1103;&#1077;&#1090;.<br></p>
<p><br></p>



<h1><a name="alt_enter"></a>&#1057;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; Alt+Enter &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1072;&#1087;&#1086;&#1082;</h1>Alt+Enter
&#1101;&#1090;&#1086; &#8212; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; Windows &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1053;&#1086; &#1085;&#1072;
&#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; Windows &#1086;&#1085;&#1072; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; &#1083;&#1077;&#1074;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1087;&#1072;&#1087;&#1082;&#1080;. &#1054;&#1085;&#1072; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;, &#1075;&#1076;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103;
&#1092;&#1072;&#1081;&#1083;&#1099;. &#1069;&#1090;&#1086; &#1085;&#1077;&#1087;&#1086;&#1083;&#1072;&#1076;&#1082;&#1072; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; Windows XP, &#1075;&#1076;&#1077; Alt+Enter &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;
&#1074; &#1086;&#1073;&#1077;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;.<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;, &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; Alt+Enter &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080;.<br></p>
<p><br></p>


<h1><a name="toolbar"></a>&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; Windows</h1>&#1055;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;
Windows Vista &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1074; Windows XP. &#1045;&#1089;&#1083;&#1080;
&#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1074; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1086;&#1082;&#1086;&#1074;&#1091;&#1102;
&#1087;&#1072;&#1085;&#1077;&#1083;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;,
&#1097;&#1077;&#1083;&#1082;&#1072;&#1103; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1074;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; "&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;". &#1065;&#1077;&#1083;&#1082;&#1072;&#1103; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081;
&#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1084;&#1077;&#1085;&#1102; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1073;&#1086;&#1083;mit &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;
&#1086;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;, &#1080; &#1087;&#1086;&#1080;&#1089;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;.<br><p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;, &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1086;&#1074;&#1091;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;:<br></p>&nbsp;<img src="images/toolbar.png" alt="&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;" title="&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;"><br> <br>
&#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;: &#1042;&#1074;&#1077;&#1088;&#1093;, &#1042;&#1099;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;, &#1050;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100;, &#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;,
&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1069;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1095;&#1090;&#1072;, &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1074;
&#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1087;&#1088;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.<br> <br> <span style="font-weight: bold; color: rgb(0, 112, 192);">&#1057;&#1086;&#1074;&#1077;&#1090;&#1099;:</span><br> &nbsp;&nbsp;&nbsp; - &#1059;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; <strong>&#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; CTRL</strong> &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1042;&#1074;&#1077;&#1088;&#1093;", &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091; &#1074; &#1085;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;.<br> &nbsp;&nbsp;&nbsp; - &#1059;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; <strong>&#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; Shift</strong> &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;", &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;<br> <br>
&#1053;&#1086;&#1074;&#1072;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1077; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;
&#1087;&#1086;&#1089;&#1083;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;. &#1055;&#1077;&#1088;&#1077;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077;:<br><ol style="font-family: Helvetica,Arial,sans-serif;">

  <li>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1085;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; Windows (Win+E)</li>
  <li>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;
&#1084;&#1077;&#1085;&#1102; &#1074; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1077; - &#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102; "&#1057;&#1077;&#1088;&#1074;&#1080;&#1089;" (Alt+T), "&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;
&#1087;&#1072;&#1087;&#1086;&#1082;" &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; "&#1042;&#1080;&#1076;" &#1080; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; "&#1042;&#1089;&#1077;&#1075;&#1076;&#1072;
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1084;&#1077;&#1085;&#1102;".</li>
  <li>&#1065;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1085;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1084;&#1077;&#1085;&#1102; &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; "&#1050;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;", &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.</li>
  <li>&#1045;&#1089;&#1083;&#1080;
&#1101;&#1090;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1085;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; (&#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; "&#1047;&#1072;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;"), &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1080;&#1079; Internet
Explorer. &#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1077; Internet Explorer, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072;
&#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; "&#1050;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;". &#1041;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086;,
&#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; "&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;", &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077;
&#1096;&#1072;&#1075;&#1080; &#1089; 1 &#1087;&#1086; 3.</li>
  <li>&#1045;&#1089;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1099; &#1085;&#1077; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1085;&#1072;&#1076;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1086;&#1073;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1069;&#1090;&#1086;
&#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074;. &#1054;&#1090;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; "&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;
&#1086;&#1073;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;", &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; "&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;", &#1080; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; "&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;".<br></li>

</ol><br><h1><a name="statusbar"></a>&#1057;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;<br></h1>Classic
Explorer &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1088;&#1080;&#1075;&#1080;&#1085;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1082;&#1072;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;: <br> <br> <img src="images/statusbar.png" style="width: 507px; height: 26px;" alt="&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;" title="&#1056;&#1072;&#1079;&#1084;&#1077;&#1088; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;"><br> <br>
&#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; 100 &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1085;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1086;&#1073;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1074;&#1089;&#1077;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1087;&#1072;&#1087;&#1082;&#1077;.<br> <br><strong>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; Windows 7:</strong>
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; Classic Explorer &#1091;&#1083;&#1091;&#1095;&#1096;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
&#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1077;&#1077; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1077;&#1077;, &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1077;&#1077; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1079;
&#1084;&#1077;&#1085;&#1102; &#1042;&#1080;&#1076;. &#1057;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; &#1089;&#1080;&#1085;&#1077;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;
&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; &#1059;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1080;&#1090;&#1100; &#1076;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1084;&#1077;&#1089;&#1090;&#1072;. &#1058;&#1072;&#1082;&#1078;&#1077;
&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1077; Windows 7, &#1095;&#1090;&#1086; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1083;&#1102;&#1073;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <strong style="color: rgb(0, 112, 192);">F5</strong>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1080;&#1076; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;.<br> <br><strong>Windows 8 note:</strong>
Classic Explorer &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1074;&#1086;&#1102; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1084;&#1077;&#1089;&#1090;&#1072;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077;
&#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; "&#1042;&#1080;&#1076;" &#1085;&#1072; &#1083;&#1077;&#1085;&#1090;&#1077;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;". &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077;
&#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; "&#1042;&#1080;&#1076;" &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093;. &#1053;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1092;&#1083;&#1072;&#1078;&#1086;&#1082; "&#1055;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;"
&#1080; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;. <br> <br><h1><a name="settings"></a>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</h1>&#1052;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; Classic Explorer &#1080;&#1079; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; &#1055;&#1091;&#1089;&#1082;: <br> <img style="width: 682px; height: 465px;" alt="" src="images/explorer_settings.png"><br> <br>&#1042;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1080;&#1083;&#1080; &#1074;&#1089;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;.
&#1053;&#1072;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1077;&#1075;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;.
&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1074; &#1087;&#1086;&#1083;&#1077; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1081;&#1090;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;.<br> &#1050;&#1072;&#1078;&#1076;&#1099;&#1081;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084;, &#1080;&#1083;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1055;&#1086;&#1089;&#1083;&#1077;
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;, &#1086;&#1085; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1078;&#1080;&#1088;&#1085;&#1099;&#1084; &#1096;&#1088;&#1080;&#1092;&#1090;&#1086;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1082;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;.<br> <br>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083; XML, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1080;&#1093; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">&#1040;&#1088;&#1093;&#1080;&#1074;&#1072;&#1094;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1101;&#1090;&#1080;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;. &#1054;&#1090;&#1090;&#1091;&#1076;&#1072; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074; &#1080;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.<br> <br>
&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; OK, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1087;&#1088;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;. &#1044;&#1083;&#1103; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1089;&#1090;&#1074;&#1072;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1074;&#1099; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;.<br> <br> <span style="font-weight: bold;"> &#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</span>
&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; "&#1042;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;" &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1074;
&#1085;&#1091;&#1078;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099;.<br> <br> &#1042;&#1086;&#1090; &#1086;&#1076;&#1080;&#1085; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1086;:<br> <img src="images/titlebar.png" alt="&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;" title="&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;"><br> <br> &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; <span style="font-weight: bold;">&#1050;&#1085;&#1086;&#1087;&#1082;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;:<br> <img style="width: 682px; height: 465px;" alt="" src="images/toolbar_settings.png"><br> <br>&#1057;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;
&#1089;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1072; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;
&#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1085;&#1072;
&#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; &#1089;&#1083;&#1077;&#1074;&#1072;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1103; &#1080;&#1093; &#1074;&#1074;&#1077;&#1088;&#1093; &#1080; &#1074;&#1085;&#1080;&#1079;.
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1077; &#1086;&#1076;&#1085;&#1091; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1102;.<br>
&#1053;&#1072;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
&#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;. &#1065;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;,
&#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1090;. &#1076;.). &#1048;&#1079; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1102; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086;
&#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;.<br> &#1050;&#1072;&#1078;&#1076;&#1099;&#1081;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103;. &#1069;&#1090;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1080;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099;, &#1094;&#1080;&#1092;&#1088;&#1099; &#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099;
&#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; (&#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;) &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1099;.<br> <br> <span style="font-weight: bold;">&#1042;&#1072;&#1078;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</span> &#1053;&#1077; &#1074;&#1089;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1079;&#1085;&#1072;&#1095;&#1082;&#1080; &#1080;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; Windows &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1074;, &#1082;&#1072;&#1082; <span style="font-weight: bold;">&#1054;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;</span>, <span style="font-weight: bold;">&#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077;</span>,
&#1080; &#1090;. &#1076;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1091;&#1076;&#1077;&#1090;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;. &#1057;&#1084;.
&#1085;&#1080;&#1078;&#1077;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;.<br> <br> &#1055;&#1086;&#1089;&#1083;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;. &#1044;&#1074;&#1072;&#1078;&#1076;&#1099; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072;
&#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1076;&#1083;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:<br> <img style="width: 446px; height: 375px;" alt="&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;" title="&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;" src="images/button_settings.png"><br> &#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; &#1076;&#1083;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1077;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090; &#1080; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</span>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;  &#1080; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;.<br> &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;:<br><ul>

  
  <li><span style="font-weight: bold;">left blank</span> - &#1077;&#1089;&#1083;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;</li>
<li><span style="font-weight: bold;">&#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1087;&#1088;&#1077;&#1076;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;</span> - &#1080;&#1079; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;</li>
  <li><span style="font-weight: bold;">open &lt;&#1074;&#1072;&#1096;&#1072; &#1087;&#1072;&#1087;&#1082;&#1072;&gt;</span> - &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1072;&#1087;&#1082;&#1091; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1086;&#1073;&#1086;&#1079;&#1088;&#1077;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;</li>
  <li><span style="font-weight: bold;">sortby &lt;&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&gt;</span> - &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1087;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086; - <span style="font-weight: bold;">&#1080;&#1084;&#1103;, &#1090;&#1080;&#1087;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; </span>&#1080;&#1083;&#1080;<span style="font-weight: bold;"> &#1076;&#1072;&#1090;&#1072;</span>. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; '-' &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1091;&#1073;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;: <span style="font-weight: bold;">"sortby -name"</span>. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1080;&#1093; &#8203;&#8203;&#1082;&#1086;&#1076;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <span style="font-weight: bold;">"sortby {B725F130-47EF-101A-A5F1-02608C9EEBAC}, 10"</span> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1084; &#1078;&#1077; &#1089;&#1072;&#1084;&#1099;&#1084; &#1095;&#1090;&#1086; &#1080; <span style="font-weight: bold;">"sortby name"</span>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086; &#1082;&#1086;&#1076;&#1072;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091; <span style="font-weight: bold;">propkey.h</span> &#1074; Windows SDK (&#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1086; &#1085;&#1080;&#1093; <a href="http://msdn.microsoft.com/en-us/library/cc251929%28v=prot.10%29.aspx">&#1079;&#1076;&#1077;&#1089;&#1100;</a>
- &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1080;&#1074; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1074;&#1085;&#1080;&#1079; &#1076;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; "&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;"). &#1053;&#1077; &#1074;&#1089;&#1077;
&#1082;&#1086;&#1076;&#1099; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099; &#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <span style="font-weight: bold;">&#1075;&#1086;&#1076; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1072;</span> <span style="font-weight: bold;">{56A3372E-CE9C-11D2-9F0E-006097C686F6}, 5</span> &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1077; &#1084;&#1091;&#1079;&#1099;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1086;&#1074;)</li>
  <li><span style="font-weight: bold;">groupby &lt;&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&gt;</span> - &#1087;&#1086;&#1093;&#1086;&#1078;&#1077; &#1085;&#1072; <span style="font-weight: bold;">sortby</span>, &#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; <span style="font-weight: bold;">groupby</span> &#1073;&#1077;&#1079; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;<br></li>


  
  <li><span style="font-weight: bold;">custom executable string</span>
- &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1084;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1077;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; URL (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
http://www.google.com). &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1099; &#1082;&#1072;&#1082; <span style="font-weight: bold;">%SystemRoot%</span>. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1080; <span style="font-weight: bold;">%1</span>, <span style="font-weight: bold;">%2</span>, <span style="font-weight: bold;">%3</span>, <span style="font-weight: bold;">%4</span> and <span style="font-weight: bold;">%5</span>:</li>
  <ul>
    <li><span style="font-weight: bold;">%1</span>
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077;. &#1048;&#1084;&#1077;&#1081;&#1090;&#1077; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;
&#1090;&#1077;&#1082;&#1091;&#1097;&#1072;&#1103; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1072;&#1103; &#1087;&#1072;&#1087;&#1082;&#1072; &#1076;&#1080;&#1089;&#1082;&#1072;, &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1082;&#1072;&#1085;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1082;&#1086;&#1089;&#1086;&#1081;
&#1095;&#1077;&#1088;&#1090;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; C:\)<br></li>
    <li><span style="font-weight: bold;">%2</span> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085; &#1092;&#1072;&#1081;&#1083;)</li>
    <li><span style="font-weight: bold;">%3</span>
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1089;&#1077;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;. &#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1076;&#1080;&#1085; &#1092;&#1072;&#1081;&#1083; &#1089;
&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1087;&#1091;&#1090;&#1077;&#1084;<br></li>
    <li><span style="font-weight: bold;">%4</span>
&#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;, &#1082;&#1072;&#1082; %3, &#1085;&#1086; &#1092;&#1072;&#1081;&#1083; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1102;&#1085;&#1080;&#1082;&#1086;&#1076; (UTF16). &#1092;&#1072;&#1081;&#1083; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;
&#1084;&#1077;&#1090;&#1082;&#1091; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1073;&#1072;&#1081;&#1090;&#1086;&#1074;. % 3% &#1080; 4 &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091;&#1078;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;<br></li>
    <li><span style="font-weight: bold;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;: </span>&#1055;&#1088;&#1080;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; %3% &#1080;&#1083;&#1080; 4, &#1086;&#1085;&#1072; &#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;. &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;
&#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084;
&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;
&#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1082;&#1086;&#1085;</li>

    <li><span style="font-weight: bold;">%5</span>
&#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103;
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1074; Classic Explorer. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; 2 &#1073;&#1072;&#1081;&#1090;&#1072;
&#1092;&#1072;&#1081;&#1083;&#1072; 255 &#1080; 254, &#1092;&#1072;&#1081;&#1083; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1102;&#1085;&#1080;&#1082;&#1086;&#1076;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;:</li>
    <ul>
      <li><span style="font-weight: bold;">open &lt;folder name&gt;</span> - &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1082; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077;</li>
      <li><span style="font-weight: bold;">select &lt;list of file names&gt;</span>
- &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1080; &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1086;&#1088; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.
&#1048;&#1084;&#1077;&#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1077;&#1081; &#1080;&#1083;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1084; &#1085;&#1086;&#1074;&#1086;&#1081;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1060;&#1072;&#1081;&#1083;&#1099; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1087;&#1091;&#1090;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1087;&#1091;&#1090;&#1100;, &#1087;&#1091;&#1090;&#1100;
&#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;<br></li>
      <li><span style="font-weight: bold;">refresh</span> - &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;</li>
    </ul>
  </ul>
  <ul>
    <li><span style="font-weight: bold;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;:</span>
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; %5 &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084;
&#1088;&#1077;&#1078;&#1080;&#1084;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; %3 &#1080;&#1083;&#1080; %4), &#1085;&#1086;
&#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1078;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085; &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1090;&#1100;
&#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;</li>
    <li>&#1057;&#1084;. &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;<br></li>

  </ul>
</ul>&#1057;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090;&#1100; &#1073;&#1099;&#1090;&#1100; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1092;&#1072;&#1081;&#1083;, &#1101;&#1090;&#1086;&#1090;
&#1092;&#1072;&#1081;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1087;&#1072;&#1087;&#1082;&#1072;, &#1087;&#1072;&#1087;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;
&#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1102; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; "&#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1085;&#1072; &#1086;&#1076;&#1080;&#1085; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1074;&#1077;&#1088;&#1093;").<br> <br> &#1047;&#1085;&#1072;&#1095;&#1082;&#1086;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;:<br style="font-weight: bold;"><ul>
  <li><span style="font-weight: bold;">left blank</span> - &#1090;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1091;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1080;<br> <span style="font-weight: bold;"></span></li>
  <li><span style="font-weight: bold;">resource file,icon ID</span> - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <span style="font-weight: bold;">%windir%\notepad.exe,2</span>. &#1053;&#1077; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;. <span style="font-weight: bold;">&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072;, &#1072; &#1085;&#1077; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072;.</span> &#1044;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1080;&#1083;&#1091;&#1095;&#1096;&#1080;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">[...]</span> &#1088;&#1103;&#1076;&#1086;&#1084; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1084; &#1086;&#1082;&#1085;&#1072;</li>
  <li><span style="font-weight: bold;">,icon ID</span> - &#1090;&#1086; &#1078;&#1077;, &#1095;&#1090;&#1086; &#1080; &#1074;&#1099;&#1096;&#1077;, &#1085;&#1086; &#1092;&#1072;&#1081;&#1083; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; <span style="font-weight: bold;">ClassicExplorer.dll</span> &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1077;&#1095;&#1100; &#1080;&#1076;&#1077;&#1090; &#1086; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072;&#1093; Classic Explorer<br></li>
  <li><span style="font-weight: bold;">icon file</span> -&nbsp; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <span style="font-weight: bold;">C:\Program Files\Mozilla Thunderbird\Email.ico</span></li>
  <li><span style="font-weight: bold;">none</span> - &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;</li>
</ul>&#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1100; &#1080;&#1083;&#1080; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; <span style="font-weight: bold;">$</span> (&#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1076;&#1086;&#1083;&#1083;&#1072;&#1088;&#1072;), &#1090;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1082;&#1072;&#1082; &#1080;&#1084;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <span style="font-weight: bold;">ExplorerL10N.ini</span>.
&#1057;&#1072;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1103;&#1079;&#1099;&#1082;&#1072;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1087;&#1088;&#1080;
&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;.<br> <br> <span style="font-weight: bold;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;: </span>&#1050;&#1085;&#1086;&#1087;&#1082;&#1080; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1080;&#1083;&#1080; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099;. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1084; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072; <span style="font-weight: bold;">HKCU\Software\OpenShell\ClassicExplorer</span>
&#1076;&#1083;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; DWORD &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; (&#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1077; &#1074; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077;
&#1089;&#1083;&#1077;&#1074;&#1072;). 0 &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081;, 1 &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086; &#1080; 2 &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1099; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1080;&#1085;&#1091;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1080;&#1093; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;, &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077; &#1080;&#1093; &#1074; &#1086;&#1082;&#1085;&#1077; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;, &#1085;&#1072;&#1081;&#1076;&#1080;&#1090;&#1077;
&#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086; &#1089; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; <span style="font-weight: bold;">OpenShell.CBandWindow</span>, &#1080; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1100;&#1090;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; <span style="font-weight: bold;">WM_CLEAR</span>. &#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; EXE-&#1092;&#1072;&#1081;&#1083; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.<br> <br><h1><a name="examples"></a>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;</h1>
<h3>0) &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1072;&#1074;&#1099;&#1095;&#1082;&#1080;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;</h3>&#1042; &#1094;&#1077;&#1083;&#1103;&#1093; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;
&#1087;&#1091;&#1090;&#1080;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1074;&#1099;&#1095;&#1082;&#1080; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1087;&#1091;&#1090;&#1080;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;. &#1050;&#1072;&#1074;&#1099;&#1095;&#1082;&#1080; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1082;&#1072;&#1082; &#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093; 1 &#1080; 2 &#1085;&#1080;&#1078;&#1077;.
&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1083;&#1080; &#1074;&#1072;&#1096;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1089; &#1087;&#1091;&#1090;&#1103;&#1084;&#1080;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;.<br> <br><h3>1) &#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080;</h3>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;: <span style="font-weight: bold;">cmd.exe /k echo %1</span>. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; %1 &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072; &#1085;&#1072; &#1087;&#1091;&#1090;&#1100; &#1082; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077;.<br> <br><h3>2) &#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1074; &#1073;&#1083;&#1086;&#1082;&#1085;&#1086;&#1090;&#1077;</h3>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;: <span style="font-weight: bold;">%SystemRoot%\notepad.exe %2</span>.
&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; %2 &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072; &#1085;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1085;&#1077;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1074; &#1082;&#1072;&#1074;&#1099;&#1095;&#1082;&#1072;&#1093;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1073;&#1083;&#1086;&#1082;&#1085;&#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074;&#1089;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1082;&#1072;&#1082; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;.<br> <br><h3>3) &#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1074; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091;<br></h3>&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight: bold;">C:\CopyParent.bat:<br><span style="font-family: monospace;"> set list=%1<br> set list=%list:"=%<br> for /F "delims=" %%i in (%list%) do copy /Y "%%i" ..<br> del %1<br style="font-family: monospace;"></span></span> <br> &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;: <span style="font-weight: bold;">C:\</span><span style="font-weight: bold;">CopyParent</span><span style="font-weight: bold;">.bat "%3"</span>.
&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; %3 &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072; &#1085;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1087;&#1086;&#1083;&#1085;&#1099;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072;
&#1074;&#1089;&#1077;&#1093; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;
&#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102;
&#1087;&#1072;&#1087;&#1082;&#1091;. &#1042; &#1082;&#1086;&#1085;&#1094;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1092;&#1072;&#1081;&#1083;&#1072;. &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; <b>&#1085;&#1072;&#1073;&#1086;&#1088;&#1072;</b> &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; &#1091;&#1076;&#1072;&#1083;&#1103;&#1102;&#1090; &#1082;&#1072;&#1074;&#1099;&#1095;&#1082;&#1080; &#1080;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; %1.<br> <br><h3>4) &#1042;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;</h3>&#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight: bold;">C:\SelectText.bat</span>:<br> <span style="font-weight: bold; font-family: monospace;">echo select &gt; %1</span><br style="font-weight: bold; font-family: monospace;"> <span style="font-weight: bold; font-family: monospace;">dir *.txt /b &gt;&gt; %1</span><br style="font-weight: bold; font-family: monospace;"> <br> &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1090;&#1091; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091;: <span style="font-weight: bold;">C:\SelectText.bat "%5".</span>
&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; %5 &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084;, &#1075;&#1076;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1083;&#1086;&#1074;&#1086; "select" &#1080; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072;. &#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; "dir
*.txt /b" &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;.<br> <br> <br><h1><a name="admin"></a>&#1040;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</h1>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;
&#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1077;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1089;&#1074;&#1086;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;. &#1040;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1077;
&#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093;:<br> <img style="width: 682px; height: 465px;" alt="" src="images/up_locked.png"><br>
&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; "&#1055;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1042;&#1074;&#1077;&#1088;&#1093;" &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;, &#1095;&#1090;&#1086;&#1073;&#1099;
&#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072;&#1084;&#1080; "&#1053;&#1072;&#1079;&#1072;&#1076; / &#1042;&#1087;&#1077;&#1088;&#1077;&#1076;" &#1080; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;
&#1083;&#1102;&#1073;&#1099;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1069;&#1090;&#1086; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1077;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1074;
&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072; <span style="font-weight: bold;">HKEY_LOCAL_MACHINE\SOFTWARE\OpenShell\ClassicExplorer</span>. &#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; "ShowUpButton" &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; "BeforeBack".<br> <br>
&#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099; &#1085;&#1077; &#1079;&#1072;&#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103;
&#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;. &#1042;
&#1090;&#1072;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1100;&#1090;&#1077; &#1080;&#1084;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; "_Default". &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;
&#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1074;&#1074;&#1077;&#1088;&#1093; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1085;&#1086; &#1087;&#1086;-&#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1087;&#1086;&#1078;&#1077;&#1083;&#1072;&#1102;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1077;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; "ShowUpButton_Default" &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074;
"BeforeBack".<br> <br> &#1057;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1080;&#1084;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;
&#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072; &#1080; &#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084;
&#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; <span style="font-weight: bold;"> HKEY_CURRENT_USER\Software\OpenShell\ClassicExplorer\Settings</span>.<br>
&#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1085;&#1086; &#1074;&#1099;
&#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; DWORD &#1080;
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1085;&#1072; 0xDEFA.<br> <br> &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <span style="font-weight: bold;">EnableSettings</span>. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; 0 &#1074; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1077; &#1074; &#1094;&#1077;&#1083;&#1103;&#1093; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;:<br> <img style="width: 603px; height: 257px;" alt="&#1054;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;" title="&#1054;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;" src="images/settings_disable_ex.png"><br> <br>
&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1080;&#1083;&#1080; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093;
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; 2 &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072; "ProcessWhiteList" &#1080;
"ProcessBlackList". <span style="font-weight: bold;">ProcessWhiteList </span>
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; Classic
Explorer. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, "&#1041;&#1083;&#1086;&#1082;&#1085;&#1086;&#1090;"),
&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1084;&#1077;&#1085; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081; &#1080;&#1083;&#1080; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1089; &#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;. <span style="font-weight: bold;">ProcessBlackList</span>
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; Classic Explorer &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1053;&#1091;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1073;&#1072;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099;, &#1095;&#1077;&#1088;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;. &#1057;&#1087;&#1080;&#1089;&#1082;&#1080;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1102;&#1090;&#1089;&#1103;
&#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;&#1084;&#1080;, &#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;. &#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1101;&#1090;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;
&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;: &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1086;&#1073;&#1097;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1080; &#1076;&#1083;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1093;
&#1086;&#1082;&#1086;&#1085; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.<br>
<br>
&#1058;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1095;&#1077;&#1088;&#1077;&#1079; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1099;&#1077; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1080;. &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083; <span style="font-weight: bold;">PolicyDefinitions.zip</span> &#1074; &#1087;&#1072;&#1087;&#1082;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; <span style="font-weight: bold;">PolicyDefinitions.rtf</span> &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.<br> <br> <br><h1><a name="dependencies"></a>&#1047;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093; Windows<br></h1>&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; Windows, &#1074; &#1094;&#1077;&#1083;&#1103;&#1093; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1080;:<br><ul>
  <li><span style="font-weight: bold;">&#1057;&#1090;&#1080;&#1083;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1086;&#1074; Windows Vista</span> - &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Aero &#1080;&#1083;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1091;&#1102; &#1090;&#1077;&#1084;&#1091; Windows</li>
  <li><span style="font-weight: bold;">&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1082; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077;</span>
- &#1069;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; "Always" &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1075;&#1076;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072;
&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; "&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1088;&#1072;&#1079;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081;
&#1087;&#1072;&#1087;&#1082;&#1080;". &#1048;&#1097;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1074; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; <span style="font-weight: bold;">&#1054;&#1073;&#1097;&#1080;&#1077;</span> &#1084;&#1077;&#1085;&#1102; <span style="font-weight: bold;">&#1057;&#1077;&#1088;&#1074;&#1080;&#1089; -&gt; &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1072;&#1087;&#1086;&#1082;</span></li>
  <li><span style="font-weight: bold;">&#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;</span>
- &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1083;&#1080;&#1073;&#1086; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1080;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080;.
&#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; "&#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100;
&#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; (&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1080;&#1077;&#1095;&#1089;&#1082;&#1072;&#1103; &#1090;&#1077;&#1084;&#1072;)" &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; <span style="font-weight: bold;">&#1042;&#1080;&#1076;</span> &#1084;&#1077;&#1085;&#1102; <span style="font-weight: bold;">&#1057;&#1077;&#1088;&#1074;&#1080;&#1089; -&gt; &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1072;&#1087;&#1086;&#1082;</span></li>
  <li><span style="font-weight: bold;">&#1042;&#1089;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;</span> - &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; (&#1085;&#1077; &#1087;&#1091;&#1090;&#1072;&#1090;&#1100; &#1089; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;&#1102; "&#1057;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;"). &#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1074; &#1084;&#1077;&#1085;&#1102; <span style="font-weight: bold;">&#1042;&#1080;&#1076; -&gt; &#1057;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;</span></li>
</ul><br><h1><a name="localization"></a>&#1051;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;</h1>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; (&#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;) &#1083;&#1086;&#1082;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; &#1085;&#1072; 35 &#1103;&#1079;&#1099;&#1082;&#1072;&#1093;.<br>
&#1044;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1077;&#1085;&#1086; &#1085;&#1072; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;
&#1103;&#1079;&#1099;&#1082;&#1086;&#1074;. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082;.
&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1103;&#1079;&#1099;&#1082;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1085;&#1072; <a href="http://www.classicshell.net/translations/">&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1086;&#1074;</a>. &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1077; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090; &#1076;&#1083;&#1103; &#1090;&#1086;&#1095;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; Open-Shell.<br> <span style="font-weight: bold;"></span><br></body></html>
