<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head>








  <meta content="text/html; charset=iso-8859-1" http-equiv="content-type"><title>Open-Shell</title>
  <style type="text/css">h1 { color: #0070c0; font-family: &quot;Times New Roman&quot;,Times,serif; } body { font-family: Arial,Helvetica,sans-serif; }</style></head><body>
<h1><a target="_blank" href="http://www.classicshell.net/"><img src="images/OpenShell.png" style="border: 0px solid ; width: 64px; height: 64px;" alt="&#1042;&#1077;&#1073;-&#1091;&#1079;&#1077;&#1083; Open-Shell" title="Open-Shell website"></a>&nbsp; Open-Shell</h1><span style="font-style: italic; color: rgb(0, 112, 192); font-weight: bold;">&#1042;&#1077;&#1088;&#1089;&#1080;&#1103;
4.3.1 – &#1086;&#1073;&#1097;&#1080;&#1081; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;</span><br><br><h1>&#1063;&#1090;&#1086; &#1090;&#1072;&#1082;&#1086;&#1077; Open-Shell?</h1><strong style="color: rgb(79, 129, 189);">Open-Shell™</strong>&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1102; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1081; &#1076;&#1083;&#1103; Windows. Open-Shell &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1055;&#1091;&#1089;&#1082;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; Windows &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1084;&#1077;&#1083;&#1082;&#1080;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;.<br><br> <br> <br><h1>&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</h1>Open-Shell &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; Windows 7, Windows 8, Windows 8.1, Windows Server 2008 R2, Windows Server 2012 &#1080; Windows Server 2012 R2. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; 32 &#1080; 64-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; (&#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;). &#1044;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1073;&#1083;&#1086;&#1078;&#1077;&#1082; &#1084;&#1077;&#1085;&#1102; &quot;&#1055;&#1091;&#1089;&#1082;&quot; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1090;&#1077;&#1084;&#1091; Aero. &#1044;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1073;&#1083;&#1086;&#1078;&#1077;&#1082; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1084;&#1072; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1080;&#1083;&#1103; Windows.<br> <br> <br><h1>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;</h1><br> Open-Shell &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1088;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;:<ul>
  <li><a href="Menu.html">Open-Shell Menu</a></li>
  <li><a href="ClassicExplorer.html">Classic Explorer</a></li>
  <li><a href="ClassicIE.html">Classic IE</a></li>
</ul><br><h1>&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;</h1>&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; Open-Shell &#1095;&#1077;&#1088;&#1077;&#1079; <span style="font-weight: bold;">&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; -&gt; &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;</span>. &#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &nbsp;&#1074; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &quot;&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;&quot;.<br> &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1080;&#1090;&#1100; &#1089;&#1077;&#1072;&#1085;&#1089; &#1076;&#1083;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;.<br> <br></body></html>
